{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "959502f2-e28d-4b85-8509-eade3b7fd919",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pickle\n",
    "import pandas as pd\n",
    "\n",
    "columns = [\"question\", \"entities\", \"mask\", \"answer_masked\", \"answer_unmasked\"]\n",
    "\n",
    "df = pd.read_csv('baf_complete.tsv', sep=\"\\t\")\n",
    "df.columns = columns\n",
    "\n",
    "df_no = pd.read_csv('baf_no_synonyms.tsv', sep=\"\\t\")\n",
    "df_no.columns = columns\n",
    "\n",
    "df_gpt = pd.read_csv('gpt.tsv', sep=\"\\t\")\n",
    "df_gpt.columns = columns\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "eec0752f-b842-4bb7-a36d-586d185783a2",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Download dataset from: https://drive.google.com/drive/folders/0B-36Uca2AvwhTWVFSUZqRXVtbUE?resourcekey=0-kdv6ho5KcpEXdI2aUdLn_g\n",
    "dataset_folder = \"\"\n",
    "dataset_file = dataset_folder + \"METAQA/kb.txt\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "bea7e89a-0966-4984-8f39-64bfee330536",
   "metadata": {},
   "outputs": [],
   "source": [
    "def load_qa_data(file):\n",
    "    questions = []\n",
    "    answers = []\n",
    "    \n",
    "    with open(file, \"r\", encoding=\"utf-8\") as f:\n",
    "        for line in f:\n",
    "            line = line.strip()  # remove newline/whitespace\n",
    "            if not line:  # skip empty lines\n",
    "                continue\n",
    "            \n",
    "            # split into question and answer part\n",
    "            q, a = line.split(\"\\t\", 1)\n",
    "            \n",
    "            # store question\n",
    "            questions.append(q)\n",
    "            \n",
    "            # split answers by \"|\" and strip whitespace\n",
    "            answers.append([ans.strip() for ans in a.split(\"|\")])\n",
    "    return questions, answers "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "17eae742-ddab-4d3b-821a-6f75410298c4",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Download dataset from: https://drive.google.com/drive/folders/0B-36Uca2AvwhTWVFSUZqRXVtbUE?resourcekey=0-kdv6ho5KcpEXdI2aUdLn_g\n",
    "test_file1 = dataset_folder+\"METAQA/1-hop/qa_test.txt\"\n",
    "test_file2 = dataset_folder+\"METAQA/2-hop/qa_test.txt\"\n",
    "test_file3 = dataset_folder+\"METAQA/3-hop/qa_test.txt\"\n",
    "\n",
    "test_questions1, test_answers1 = load_qa_data(test_file1)\n",
    "test_questions2, test_answers2 = load_qa_data(test_file2)\n",
    "test_questions3, test_answers3 = load_qa_data(test_file3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "d3556949-541c-4959-b21f-9627df253cd4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of test questions: 39093\n"
     ]
    }
   ],
   "source": [
    "print('Number of test questions:', len(test_questions1) + len(test_questions2) + len(test_questions3))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "e4759bec-4bcf-4a85-9735-39775fac3be9",
   "metadata": {},
   "outputs": [],
   "source": [
    "import re\n",
    "\n",
    "def escape_quotes_in_brackets(text):\n",
    "    def replacer(match):\n",
    "        inside = match.group(1)\n",
    "        # Escape all single quotes inside the brackets\n",
    "        return \"[\" + inside.replace(\"'\", r\"\\'\") + \"]\"\n",
    "    \n",
    "    # Find [ ... ] groups and apply replacer\n",
    "    return re.sub(r\"\\[([^\\]]*)\\]\", replacer, text)\n",
    "\n",
    "def questions_stats(test_question, test_answer):\n",
    "    questions = {}\n",
    "    unique_questions = []\n",
    "    unique_answers = []\n",
    "    for question, answer in zip(test_question, test_answer):\n",
    "        unique_question =  re.sub(r\"\\[.*?\\]\", \"\", question)\n",
    "    \n",
    "        if unique_question in questions:\n",
    "            questions[unique_question] += 1\n",
    "        else:\n",
    "            questions[unique_question] = 1\n",
    "            # Add spaces around only , . ! ?\n",
    "            text_spaced = re.sub(r',(?![^\\[]*\\])', r' , ', question)\n",
    "            # Remove extra spaces\n",
    "            text_spaced = re.sub(r'\\s+', ' ', text_spaced).strip()\n",
    "            unique_questions.append(text_spaced)\n",
    "            unique_answers.append(answer)\n",
    "    \n",
    "    less_frequent = len(test_question)\n",
    "    more_frequent = 0\n",
    "    for q in questions:\n",
    "        if questions[q] < less_frequent:\n",
    "            less_frequent = questions[q]\n",
    "        if questions[q] > more_frequent:\n",
    "            more_frequent = questions[q]\n",
    "\n",
    "    return ({\n",
    "        'len_questions' : len(test_question),\n",
    "        'unique_questions' : len(questions),\n",
    "        'less_frequent' : less_frequent,\n",
    "        'more_frequent' : more_frequent\n",
    "    }, unique_questions, unique_answers)    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "96aa7e2f-0a05-4975-a996-5942b845d9bf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of unique questions: 503\n"
     ]
    }
   ],
   "source": [
    "stats1, unique_questions1, unique_answers1 = questions_stats(test_questions1, test_answers1)\n",
    "stats2, unique_questions2, unique_answers2 = questions_stats(test_questions2, test_answers2)\n",
    "stats3, unique_questions3, unique_answers3 = questions_stats(test_questions3, test_answers3)\n",
    "\n",
    "sample_questions = unique_questions1 + unique_questions2 + unique_questions3\n",
    "sample_answers = unique_answers1 + unique_answers2 + unique_answers3\n",
    "\n",
    "print(\"Number of unique questions:\", len(sample_questions))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "f08f7db2-a4b9-4739-828d-cec0fafb64bc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connection with the server stablished successfully.\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# Server details\n",
    "URI = \"neo4j://localhost:7687\"\n",
    "AUTH = (\"neo4j\", \"neo4j123\")\n",
    "DATABASE_NAME = \"neo4j\"\n",
    "\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()\n",
    "    print(\"Connection with the server stablished successfully.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "ee5c2044-b35e-4c62-b5f4-5185bad0d608",
   "metadata": {},
   "outputs": [],
   "source": [
    "from tqdm import tqdm\n",
    "def run_cypher(baf_answers, URI, AUTH):\n",
    "    #Run CYPHER queries\n",
    "    driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "    \n",
    "    results = []\n",
    "    for answer in tqdm(baf_answers):\n",
    "        try:\n",
    "            records, summary, keys = driver.execute_query(answer,database_=DATABASE_NAME)\n",
    "            results.append((records, summary, keys))\n",
    "        except:\n",
    "            results.append(([], None, None))\n",
    "    driver.close()\n",
    "\n",
    "    parsed_results = []\n",
    "    for result in results:\n",
    "        data = result[0]  # this is a list of dictionaries\n",
    "        parsed_results.append([v for d in data for v in d.values()])\n",
    "    \n",
    "    return parsed_results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "11acc0da-600c-4c08-a4f9-bc55c7515246",
   "metadata": {},
   "outputs": [],
   "source": [
    "from typing import List\n",
    "\n",
    "def accuracy_score(ground_truth: List[List[str]], predictions: List[List[str]]):\n",
    "    wrong = []\n",
    "    correct = 0\n",
    "    total = len(ground_truth)\n",
    "    \n",
    "    for i, (gt, pred) in enumerate(zip(ground_truth, predictions)):\n",
    "        # Flatten pred if it contains lists\n",
    "        flattened = [x for item in pred for x in (item if isinstance(item, list) else [item])]\n",
    "        \n",
    "        if set(gt) == set(flattened):\n",
    "            correct += 1\n",
    "        else:\n",
    "            wrong.append([i, gt, pred])\n",
    "\n",
    "    acc = correct / total if total > 0 else 0.0\n",
    "    return acc, wrong"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6ec14636-1dc7-484d-8f90-bdec1e988c9c",
   "metadata": {},
   "source": [
    "### AskSafely"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a596b782-ee78-4dfa-85b4-9f1c8622b0b2",
   "metadata": {},
   "outputs": [],
   "source": [
    "parsed_results = run_cypher(list(df['answer_unmasked']), URI, AUTH)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "9ce0078b-82e2-4e56-8208-24dc1b989d10",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Accuracy: 0.7370517928286853\n",
      "#Errors: 132\n"
     ]
    }
   ],
   "source": [
    "acc, wrong_answers = accuracy_score(sample_answers[1:], parsed_results)\n",
    "print(\"Accuracy:\", acc_no)\n",
    "print(\"#Errors:\", len(wrong_answers_no))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "d0d37b5b-4e7a-46f2-8164-f918c7675711",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "True accuracy:  0.8685258964143426\n"
     ]
    }
   ],
   "source": [
    "print(\"True accuracy: \", ((502 - len(wrong_answers) + 31) / 502))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "38bbaeb6-3049-4b2c-a0b3-b6893ad6c16f",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "20 what did [Garth Jennings] direct\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(m.name) = toLower('Garth Jennings') RETURN DISTINCT d.name\n",
      "[\"The Hitchhiker's Guide to the Galaxy\", 'Son of Rambow']\n",
      "[]\n",
      "\n",
      "29 the film [Pennies from Heaven] starred which actors\n",
      "MATCH (m:Movie)-[r]-(a:Actor) WHERE toLower(m.name) = toLower('Pennies from Heaven') RETURN DISTINCT a.name\n",
      "['Bing Crosby', 'Louis Armstrong', 'Madge Evans', 'Edith Fellows']\n",
      "['Madge Evans', 'Bing Crosby', 'Steve Martin', 'Louis Armstrong', 'Bernadette Peters', 'Edith Fellows', 'Jessica Harper']\n",
      "\n",
      "63 what was the genre of the film [Bad Boys]\n",
      "MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(m.name) = toLower('Bad Boys') RETURN DISTINCT g.name\n",
      "['Drama', 'Crime']\n",
      "['Drama', 'Comedy', 'Crime', 'Action']\n",
      "\n",
      "80 describe [The Butcher Boy]\n",
      "MATCH (m:Movie) WHERE any(tag IN m.has_tags WHERE toLower(tag) = toLower('The Butcher Boy')) RETURN DISTINCT m.name\n",
      "['neil jordan']\n",
      "[]\n",
      "\n",
      "84 can you give a few words describing [The Iron Horse]\n",
      "MATCH (m:Movie) WHERE ANY(tag IN m.has_tags WHERE toLower(tag) = toLower('The Iron Horse')) RETURN DISTINCT m.name LIMIT 5\n",
      "['john ford', 'silent']\n",
      "[]\n",
      "\n",
      "88 who was the writer of the film [Molière]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Molière') RETURN DISTINCT w.name\n",
      "['Ariane Mnouchkine']\n",
      "['Ariane Mnouchkine', 'Grégoire Vigneron', 'Laurent Tirard']\n",
      "\n",
      "93 which person wrote the movie [Ned Kelly]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Ned Kelly') RETURN DISTINCT w.name\n",
      "['Tony Richardson']\n",
      "['John Michael McDonagh', 'Tony Richardson', 'Robert Drewe']\n",
      "\n",
      "101 who in the world wrote [Journey to the Center of the Earth]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Journey to the Center of the Earth') RETURN DISTINCT w.name\n",
      "['Rusty Lemorande']\n",
      "['Jules Verne', 'Rusty Lemorande', 'Charles Brackett']\n",
      "\n",
      "106 what was the release date of [The Man Who Laughs]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('The Man Who Laughs') RETURN DISTINCT m.release_year\n",
      "['2012']\n",
      "[['2012', '1928']]\n",
      "\n",
      "110 when was the movie [Stardust] released\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Stardust') RETURN DISTINCT m.release_year\n",
      "['2007']\n",
      "[['2007', '1974']]\n",
      "\n",
      "116 what year was [Doppelganger] released\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Doppelganger') RETURN DISTINCT m.release_year\n",
      "['2003']\n",
      "[['1993', '2003']]\n",
      "\n",
      "143 who are movie co-directors of [Delbert Mann]\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(m.name) = toLower('Delbert Mann') RETURN DISTINCT d.name\n",
      "['Franco Zeffirelli', 'Cary Fukunaga', 'Lewis Milestone', 'Robert Stevenson']\n",
      "[]\n",
      "\n",
      "145 the screenwriter [Mimsy Farmer] co-wrote movies with who\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(co:Writer) WHERE toLower(w.name) = toLower('Mimsy Farmer') AND toLower(m.name) = toLower('Movie') AND co <> w RETURN DISTINCT co.name\n",
      "['Barbet Schroeder']\n",
      "[]\n",
      "\n",
      "154 the movies starred by [Dorothy Malone] were directed by who\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(m.name) = toLower('Dorothy Malone') RETURN DISTINCT d.name\n",
      "['Rob Cohen', 'Andrew L. Stone', 'Joseph Pevney', 'Raoul Walsh', 'Robert Aldrich', 'John Ireland', 'Douglas Sirk', 'Charles Marquis Warren']\n",
      "[]\n",
      "\n",
      "179 who are movie co-writers of [Al Pacino]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Al Pacino') RETURN DISTINCT w.name\n",
      "['William Shakespeare']\n",
      "[]\n",
      "\n",
      "181 who co-wrote films with [Louise Lasser]\n",
      "MATCH (m:Movie)-[r1]-(co:Writer), (m)-[r2]-(w:Writer) WHERE toLower(m.name) = toLower('Movie') AND toLower(w.name) = toLower('Louise Lasser') AND co <> w RETURN DISTINCT co.name\n",
      "['Mickey Rose', 'Woody Allen']\n",
      "[]\n",
      "\n",
      "186 who co-directed films with [Buddy Giovinazzo]\n",
      "MATCH (m:Movie)-[r]-(d1:Director) MATCH (m)-[r2]-(d2:Director) WHERE toLower(m.name) = toLower('Movie') AND toLower(d1.name) = toLower('Buddy Giovinazzo') AND d2 <> d1 RETURN DISTINCT d2.name\n",
      "['Richard Stanley', 'Tom Savini', 'Karim Hussain', 'Douglas Buck', 'David Gregory']\n",
      "[]\n",
      "\n",
      "191 which person wrote the movies directed by [Niki Caro]\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) = toLower('Niki Caro') MATCH (m)-[r2]-(w:Writer) RETURN DISTINCT w.name\n",
      "['Michael Seitzman', 'Clara Bingham', 'Witi Ihimaera', 'Laura Leedy']\n",
      "['Niki Caro', 'Witi Ihimaera', 'Clara Bingham', 'Michael Seitzman', 'Laura Leedy']\n",
      "\n",
      "196 who are co-stars of [Gabriel Tigerman]\n",
      "MATCH (m:Movie)-[r]-(a:Actor) WHERE toLower(m.name) = toLower('Gabriel Tigerman') RETURN DISTINCT a.name\n",
      "['Michael Ironside', 'Mark Gantt', 'Vanessa Marcil']\n",
      "[]\n",
      "\n",
      "205 who are the writers of the movies directed by [Jack Plotnick]\n",
      "MATCH (m:Movie)-[r]-(d:Director), (m)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('Jack Plotnick') RETURN DISTINCT w.name\n",
      "['Sam Pancake', 'Michael Stoyanov', 'Kali Rocha']\n",
      "['Kali Rocha', 'Sam Pancake', 'Jack Plotnick', 'Michael Stoyanov']\n",
      "\n",
      "215 what are the main languages in [Björne Larson] directed films\n",
      "MATCH (m:Movie)-[r]-(l:Language) WHERE toLower(m.name) = toLower('Björne Larson') RETURN DISTINCT l.name\n",
      "['Swedish']\n",
      "[]\n",
      "\n",
      "216 who wrote movies together with [Frederick Treves]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Frederick Treves') RETURN DISTINCT w.name\n",
      "['Ashley Montagu', 'Eric Bergren', 'Christopher De Vore', 'Bernard Pomerance', 'David Lynch', 'Steve Lawson']\n",
      "[]\n",
      "\n",
      "220 who are film co-writers of [Tim Burns]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Tim Burns') RETURN DISTINCT w.name\n",
      "['Alex Winter', 'Tom Stern']\n",
      "[]\n",
      "\n",
      "223 which screenwriters co-wrote films with [Charles Lederer]\n",
      "MATCH (m:Movie)-[r1]-(w1:Writer), (m)-[r2]-(w2:Writer) WHERE toLower(m.name) = toLower('Movie') AND toLower(w1.name) = toLower('Charles Lederer') AND w2 <> w1 RETURN DISTINCT w2.name\n",
      "['Charles MacArthur', 'John Taintor Foote', 'Bartlett Cormack', 'Wendell Mayes', 'Hanns Kräly', 'Billy Wilder', 'Anita Loos', 'Dorothy Kingsley', 'Charles Nordhoff', 'Abe Burrows', 'I.A.L. Diamond', 'Eleazar Lipsky', 'Lew Lipton', 'James Norman Hall', 'Ben Hecht']\n",
      "[]\n",
      "\n",
      "224 what were the release dates of [Bruce McCulloch] directed movies\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Bruce McCulloch') RETURN DISTINCT m.release_year\n",
      "['2002', '1998', '1999']\n",
      "[]\n",
      "\n",
      "226 the movies written by [Mark Miller] starred who\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(a:Actor) WHERE toLower(w.name) = toLower('Mark Miller') RETURN DISTINCT a.name\n",
      "['Donovan Scott', 'Keanu Reeves', 'Anthony Quinn', 'Bridgette Andersen', 'Giancarlo Giannini']\n",
      "['Anthony Quinn', 'Giancarlo Giannini', 'Keanu Reeves', 'Bridgette Andersen', 'Mark Miller', 'Donovan Scott']\n",
      "\n",
      "238 the screenwriter [Novalyne Price Ellis] wrote films together with who\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(co:Writer) WHERE toLower(w.name) = toLower('Novalyne Price Ellis') AND co <> w RETURN DISTINCT m.name, co.name\n",
      "['Michael Scott Myers']\n",
      "['The Whole Wide World', 'Michael Scott Myers']\n",
      "\n",
      "245 who is listed as director of [George Oppenheimer] written movies\n",
      "MATCH (m:Movie)-[r1]-(w:Writer), (m:Movie)-[r2]-(d:Director) WHERE toLower(m.name) = toLower('George Oppenheimer') RETURN DISTINCT d.name\n",
      "['Jack Conway', 'William K. Howard', 'Vincent Sherman']\n",
      "[]\n",
      "\n",
      "258 who wrote the screenplay for the movies starred by [Chris Stapp]\n",
      "MATCH (a:Actor)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(a.name) = toLower('Chris Stapp') RETURN DISTINCT w.name\n",
      "['Matt Heath']\n",
      "['Chris Stapp', 'Matt Heath']\n",
      "\n",
      "275 the screenwriter [Myron Brinig] co-wrote films with who\n",
      "MATCH (w1:Writer)-[r]-(m:Movie)-[r2]-(w2:Writer) WHERE toLower(w1.name) = toLower('Myron Brinig') AND toLower(m.name) = toLower('Movie') AND w2 <> w1 RETURN DISTINCT w2.name\n",
      "['Milton Krims']\n",
      "[]\n",
      "\n",
      "277 who is listed as screenwriter of [Susanna Fogel] directed films\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Susanna Fogel') RETURN DISTINCT w.name\n",
      "['Joni Lefkowitz']\n",
      "[]\n",
      "\n",
      "304 what are the movies that are directed by the same director of [Timeline]\n",
      "MATCH (target:Movie) WHERE toLower(target.name) = toLower('Timeline') MATCH (target)-[r1]-(d:Director) MATCH (m:Movie)-[r2]-(d) RETURN DISTINCT m.name\n",
      "['16 Blocks', 'Lola', 'Assassins', 'The Goonies', 'Lethal Weapon 3', 'Inside Moves', 'Radio Flyer', 'Ladyhawke', 'Lethal Weapon', 'The Toy', 'Superman II', 'Lethal Weapon 4', 'Conspiracy Theory', 'The Omen', 'Lethal Weapon 2', 'Scrooged', 'Maverick', 'Superman']\n",
      "['The Toy', 'The Omen', 'Lethal Weapon', '16 Blocks', 'Lethal Weapon 2', 'Lethal Weapon 3', 'Assassins', 'Radio Flyer', 'Lethal Weapon 4', 'Superman', 'Maverick', 'The Goonies', 'Scrooged', 'Lola', 'Timeline', 'Inside Moves', 'Superman II', 'Conspiracy Theory', 'Ladyhawke']\n",
      "\n",
      "307 who is listed as director of [Jarrad Paul] written films\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(m.name) = toLower('Jarrad Paul') RETURN DISTINCT d.name\n",
      "['Peyton Reed']\n",
      "[]\n",
      "\n",
      "308 which screenwriters co-wrote movies with [Tess Slesinger]\n",
      "MATCH (m:Movie)-[r1]-(w1:Writer), (m)-[r2]-(w2:Writer) WHERE toLower(m.name) = toLower('Movie') AND toLower(w1.name) = toLower('Tess Slesinger') AND w2 <> w1 RETURN DISTINCT w2.name\n",
      "['Talbot Jennings', 'Betty Smith', 'Pearl S. Buck', 'Claudine West']\n",
      "[]\n",
      "\n",
      "317 who are the writers of the films directed by [James Dearden]\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('James Dearden') RETURN DISTINCT w.name\n",
      "['Lawrence Roman', 'Barry Unsworth', 'Nick Leeson', 'Ira Levin']\n",
      "['Lawrence Roman', 'James Dearden', 'Ira Levin', 'Nick Leeson', 'Barry Unsworth']\n",
      "\n",
      "320 the movies written by [Costa Botes] were directed by who\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(d:Director) WHERE toLower(w.name) = toLower('Costa Botes') RETURN DISTINCT d.name\n",
      "['Peter Jackson']\n",
      "['Peter Jackson', 'Costa Botes']\n",
      "\n",
      "333 who directed movies together with [Ulli Lommel]\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(m.name) = toLower('Ulli Lommel') RETURN DISTINCT d.name\n",
      "['James McTeigue', 'Lew Landers', 'Roger Corman']\n",
      "[]\n",
      "\n",
      "337 the films directed by [Jules Stewart] were written by who\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('Jules Stewart') RETURN DISTINCT w.name\n",
      "['Jared Kurt']\n",
      "['Jared Kurt', 'Jules Stewart']\n",
      "\n",
      "344 who is listed as screenwriter of [Raoul Ruiz] directed movies\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Raoul Ruiz') RETURN DISTINCT w.name\n",
      "['Gilbert Adair', 'Duane Poole']\n",
      "[]\n",
      "\n",
      "348 who are film co-directors of [Edgar G. Ulmer]\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(m.name) = toLower('Edgar G. Ulmer') RETURN DISTINCT d.name\n",
      "['Catherine Breillat', 'Severin Eskeland', 'Edward Dmytryk']\n",
      "[]\n",
      "\n",
      "349 what are the main languages in [Lisa Aschan] directed movies\n",
      "MATCH (m:Movie)-[r]-(l:Language) WHERE toLower(m.name) = toLower('Lisa Aschan') RETURN DISTINCT l.name\n",
      "['Swedish']\n",
      "[]\n",
      "\n",
      "350 [Tim Burton] directed films together with who\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(m.name) = toLower('Tim Burton') RETURN DISTINCT d.name\n",
      "['Mike Johnson', 'Franklin J. Schaffner', 'Norman Z. McLeod']\n",
      "[]\n",
      "\n",
      "355 what were the release years of the films that share writers with the film [Grown Ups 2]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(w.name) = toLower('Grown Ups 2') RETURN DISTINCT m.release_year\n",
      "['1995', '1996', '1999', '1998', '1989', '2002', '2000', '2008', '2011', '2010']\n",
      "[]\n",
      "\n",
      "356 who is listed as director of the films starred by [The Inner Circle] actors\n",
      "MATCH (a:Actor)-[r]-(m:Movie)-[r2]-(d:Director) WHERE toLower(a.name) = toLower('The Inner Circle') RETURN DISTINCT d.name\n",
      "['John Landis', 'Atom Egoyan', 'Gary Trousdale', 'Steven Spielberg', 'Louis Leterrier', 'Alan Alda', 'Nora Ephron', 'Wolfgang Petersen', 'Allen Coulter', 'Richard Benjamin', 'Orson Welles', 'Neil Jordan', 'William Dieterle', 'Stephen Frears', 'Peter Yates', 'Markus Schleinzer', 'Wayne Wang', 'Jean Delannoy', 'Robert Zemeckis', 'Guy Jenkin', 'Christopher Hampton', 'Jack Clayton', 'Rocky Morton', 'Annabel Jankel', 'Mike Hodges', 'Kirk Wise', 'Ellen Perry', 'John Byrum', 'Abel Ferrara', 'Robert M. Young']\n",
      "[]\n",
      "\n",
      "359 who are the directors of the movies written by the writer of [She]\n",
      "MATCH (m_ad:Movie)-[r1]-(w:Writer) WHERE toLower(m_ad.name) = toLower('She') MATCH (m:Movie)-[r2]-(w) MATCH (m)-[r3]-(d:Director) RETURN DISTINCT d.name\n",
      "['Gary Nelson']\n",
      "['Gary Nelson', 'Robert Day']\n",
      "\n",
      "361 who directed movies for the writer of [The Broken Circle Breakdown]\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(d:Director) WHERE toLower(w.name) = toLower('The Broken Circle Breakdown') RETURN DISTINCT d.name\n",
      "['Felix van Groeningen']\n",
      "[]\n",
      "\n",
      "362 when did the movies starred by [Jupiter Ascending] actors release\n",
      "MATCH (m:Movie)-[r]-(a:Actor) WHERE toLower(a.name) = toLower('Jupiter Ascending') RETURN DISTINCT m.release_year\n",
      "['2007', '2014', '2008', '2009', '2011', '2010', '2013', '2012']\n",
      "[]\n",
      "\n",
      "364 when did the films written by [Send Me No Flowers] writers release\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(w.name) = toLower('Send Me No Flowers') RETURN DISTINCT m.release_year\n",
      "['1983', '1932', '1966', '1941', '1972', '1944', '1961', '1954', '1938', '1958']\n",
      "[]\n",
      "\n",
      "366 what genres are the movies starred by [Trog] actors\n",
      "MATCH (a:Actor)-[r]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(a.name) = toLower('Trog') RETURN DISTINCT g.name\n",
      "['Horror', 'Drama', 'Fantasy', 'Music', 'Western', 'Comedy', 'Musical', 'Thriller']\n",
      "[]\n",
      "\n",
      "370 who starred films for the director of [Flickering Lights]\n",
      "MATCH (m0:Movie)-[r1]-(d:Director) WHERE toLower(m0.name) = toLower('Flickering Lights') MATCH (d)-[r2]-(m:Movie) MATCH (m)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Mads Mikkelsen', 'Ulrich Thomsen', 'Line Kruse', 'Nikolaj Lie Kaas']\n",
      "['Mads Mikkelsen', 'Ulrich Thomsen', 'Nikolaj Lie Kaas', 'Line Kruse', 'Søren Pilmark']\n",
      "\n",
      "373 which person wrote the films acted by the actors in [The Slingshot]\n",
      "MATCH (a:Actor)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(a.name) = toLower('The Slingshot') RETURN DISTINCT w.name\n",
      "['Matt Damon', 'Ben Affleck', 'J.D. Zeik', 'Dashiell Hammett', 'Eric Lomax', 'Ronald Harwood', 'David Mamet', 'Hans Petter Moland', 'Aimee Lagos', 'Catherine Johnson', 'Steve Barancik', 'Hans Alfredson', 'Wesley Strick', 'Zafar Hai', 'Kjell Grede']\n",
      "[]\n",
      "\n",
      "380 the films written by the writer of [Lions for Lambs] starred who\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Lions for Lambs') MATCH (m)-[r1]-(w:Writer) MATCH (m2:Movie)-[r2]-(w) MATCH (m2)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Rachel McAdams', 'Ben Affleck', 'Brad Pitt', 'Russell Crowe', 'Jennifer Garner', 'Jamie Foxx', 'Chris Cooper', 'Jason Bateman', 'Helen Mirren']\n",
      "['Brad Pitt', 'Meryl Streep', 'Tom Cruise', 'Robert Redford', 'Jamie Foxx', 'Jennifer Garner', 'Chris Cooper', 'Jason Bateman', 'Helen Mirren', 'Russell Crowe', 'Rachel McAdams', 'Ben Affleck']\n",
      "\n",
      "382 what were the release dates of films starred by actors in [The Teahouse of the August Moon]\n",
      "MATCH (m:Movie)-[r1]-(a:Actor)-[r2]-(m2:Movie) WHERE toLower(m.name) = toLower('The Teahouse of the August Moon') RETURN DISTINCT m2.release_year\n",
      "['1953', '1925', '1984', '1968', '1969', '1980', '1964', '1965', '1966', '1967', '1960', '1961', '1962', '1963', '1955', '1954', '1957', '1951', '1950', '1935', '1952', '1997', '1958', '1990', '1995', '1994', '1979', '1996', '1977', '1976', '1978', '1972', '2001', '2006']\n",
      "[['1964'], ['1978'], ['1972'], ['1976'], ['1954'], ['1960'], ['1968'], ['1967'], ['1968', '2006'], ['1955'], ['1965'], ['1980'], ['1977', '1996'], ['1961'], ['1990', '1925'], ['1979'], ['1962', '1935'], ['1953'], None, ['1952'], ['1963'], ['1957'], ['1966'], ['1950'], ['1966', '1994'], ['1951', '1984', '1995'], ['1958'], ['1969'], ['1997'], ['2001']]\n",
      "\n",
      "383 who are the actors in the films directed by the director of [The Mirror Has Two Faces]\n",
      "MATCH (m1:Movie)-[r1]-(d:Director) WHERE toLower(m1.name) = toLower('The Mirror Has Two Faces') MATCH (d)-[r2]-(m:Movie) MATCH (m)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Barbra Streisand', 'Nick Nolte']\n",
      "['Lauren Bacall', 'George Segal', 'Jeff Bridges', 'Barbra Streisand', 'Nick Nolte']\n",
      "\n",
      "385 when did the movies release whose writers also wrote [Birdy]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(w.name) = toLower('Birdy') RETURN DISTINCT m.release_year\n",
      "['1989']\n",
      "[]\n",
      "\n",
      "386 which person directed the films acted by the actors in [Kid Millions]\n",
      "MATCH (a:Actor)-[r1]-(m:Movie)-[r2]-(d:Director) WHERE toLower(a.name) = toLower('Kid Millions') RETURN DISTINCT d.name\n",
      "['David Butler']\n",
      "[]\n",
      "\n",
      "394 who wrote movies that share actors with the movie [Jarhead]\n",
      "MATCH (m1:Movie) WHERE toLower(m1.name) = toLower('Jarhead') MATCH (m1)-[r]-(a:Actor)-[r]-(m2:Movie)-[r]-(w:Writer) WHERE m2 <> m1 RETURN DISTINCT w.name\n",
      "['Jonathan Raymond', 'Roberto Orci', 'Michael Mann', 'Michael Green', 'Greg Berlanti', 'Michael Goldenberg', 'David Auburn', 'Will Gluck', 'Susannah Grant', 'Kurt Wimmer', 'James Vanderbilt', 'Michael Chabon', 'Robert Graysmith', 'Dan Gilroy', 'Anthony Yerkovich', 'Rebecca Miller', 'Billy Ray', 'Marc Guggenheim', 'Thomas Meehan', 'Steve Lopez', 'Annie Proulx', 'J. Stanford Parker', 'Kimberly Peirce', 'Wayne Wang', 'Anders Thomas Jensen', 'José Saramago', 'Quentin Tarantino', 'Stuart Beattie', 'Carol Sobieski', 'Rawson Marshall Thurber', 'Taylor Hackford', 'David Ayer', 'Tom Eyen', 'Larry McMurtry', 'Takashi Bufford', 'Kelly Reichardt', 'Andy Bienen', 'Harold Gray', 'Alex Kurtzman', 'Roland Emmerich', 'Susanne Bier', 'Bill Condon', 'Andy Bellin', 'Diana Ossana', 'Matthew Michael Carnahan', 'Ben Ripley', 'Javier Gullón', 'Richard Kelly', 'Jocelyn Moorhouse']\n",
      "[]\n",
      "\n",
      "396 what genres are the films written by [Mac and Me] screenwriters\n",
      "MATCH (m:Movie)-[r1]-(w:Writer) WHERE toLower(w.name) = toLower('Mac and Me') MATCH (m)-[r2]-(g:Genre) RETURN DISTINCT g.name\n",
      "['Drama', 'Adventure']\n",
      "[]\n",
      "\n",
      "398 which person directed the movies starred by the actors in [Common]\n",
      "MATCH (m:Movie)-[r1]-(a:Actor), (m)-[r2]-(d:Director) WHERE toLower(m.name) = toLower('Common') RETURN DISTINCT d.name\n",
      "['Robert Altman', 'Tim Burton', 'David Hare', 'John Irvin', 'Karel Reisz', 'Kevin Costner', 'Rupert Wyatt', 'John Frankenheimer', 'Scott Michell', 'Barry Levinson', 'Károly Makk']\n",
      "['David Blair']\n",
      "\n",
      "399 what were the release years of the movies that share directors with the movie [The Package]\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) = toLower('The Package') UNWIND m.release_year AS release_year RETURN DISTINCT release_year\n",
      "['1990', '1993', '1985', '1995', '1996', '1998', '1947', '1988', '2002', '1992', '2006']\n",
      "[]\n",
      "\n",
      "403 when did the films directed by the [Return of the Fly] director release\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) = toLower('Return of the Fly') RETURN DISTINCT m.release_year\n",
      "['1956', '1958']\n",
      "[]\n",
      "\n",
      "404 when did the films starred by [Falling Down] actors release\n",
      "MATCH (m:Movie)-[r]-(a:Actor) WHERE toLower(a.name) = toLower('Falling Down') RETURN DISTINCT m.release_year\n",
      "['1997', '1926', '1987', '1984', '1985', '1983', '1981', '1988', '1989', '2014', '2011', '2013', '2012', '1956', '1969', '1991', '1990', '1993', '1992', '1995', '1994', '1979', '1996', '1977', '1998', '1975', '1978', '1973', '1972', '1971', '2002', '2003', '2000', '2001', '2006', '2007', '1976', '2008', '2009']\n",
      "[]\n",
      "\n",
      "405 what genres are the movies directed by the [Slumdog Millionaire] director\n",
      "MATCH (d:Director)-[r]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(d.name) = toLower('Slumdog Millionaire') RETURN DISTINCT g.name\n",
      "['Drama', 'Comedy', 'Adventure', 'Thriller', 'Crime']\n",
      "[]\n",
      "\n",
      "411 the films written by the screenwriter of [Last Night] were directed by who\n",
      "MATCH (ad:Movie)-[r1]-(w:Writer) WHERE toLower(ad.name) = toLower('Last Night') MATCH (m:Movie)-[r2]-(w) MATCH (m)-[r3]-(d:Director) RETURN DISTINCT d.name\n",
      "['John Maybury', 'François Girard', 'Fernando Meirelles']\n",
      "['Fernando Meirelles', 'John Maybury', 'François Girard', 'Don McKellar', 'Massy Tadjedin']\n",
      "\n",
      "412 what were the release years of the films that share directors with the film [Safe]\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) = toLower('Safe') RETURN DISTINCT m.release_year\n",
      "['1991', '1994', '1998', '2002', '2003', '2000', '2008']\n",
      "[]\n",
      "\n",
      "416 who is listed as director of the movies starred by [Solo] actors\n",
      "MATCH (a:Actor)-[r]-(m:Movie)-[r2]-(d:Director) WHERE toLower(a.name) = toLower('Solo') RETURN DISTINCT d.name\n",
      "['Jonathan Kesselman', 'Stuart Gillard', 'Daniel Petrie', 'Walter Hill', 'Joel Schumacher', 'Kirk Douglas', 'Gavin Wilding', 'Dave Parker', 'Anthony Hickox', 'Mario Van Peebles', 'Bruce Malmuth']\n",
      "[]\n",
      "\n",
      "417 the movies written by the screenwriter of [Sinbad and the Eye of the Tiger] starred who\n",
      "MATCH (ad:Movie)-[r1]-(w:Writer)-[r2]-(m:Movie)-[r3]-(a:Actor) WHERE toLower(ad.name) = toLower('Sinbad and the Eye of the Tiger') RETURN DISTINCT m.name, a.name\n",
      "['John Phillip Law']\n",
      "['The Golden Voyage of Sinbad', 'John Phillip Law']\n",
      "\n",
      "418 who are the directors of the films written by the writer of [Two for the Road]\n",
      "MATCH (m:Movie)-[r1]-(w:Writer) WHERE toLower(m.name) = toLower('Two for the Road') MATCH (w)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(d:Director) RETURN DISTINCT d.name\n",
      "['John Schlesinger', 'Peter Bogdanovich', 'Stanley Kubrick', 'Johan Kling']\n",
      "['John Schlesinger', 'Peter Bogdanovich', 'Stanley Kubrick', 'Stanley Donen', 'Johan Kling']\n",
      "\n",
      "419 what genres are the movies written by [Antonio das Mortes] writers\n",
      "MATCH (w:Writer)-[r]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(w.name) = toLower('Antonio das Mortes') RETURN DISTINCT g.name\n",
      "['Drama']\n",
      "[]\n",
      "\n",
      "420 who is listed as screenwriter of the movies starred by [Stormy Waters] actors\n",
      "MATCH (a:Actor)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(a.name) = toLower('Stormy Waters') RETURN DISTINCT w.name\n",
      "['Willard Robertson', 'Victor Hugo', 'Michel Audiard', 'Joshua Logan', 'Jack Moffitt', 'Herbert Kretzmer', 'René Barjavel', 'Casey Robinson', 'Claude Lelouch', 'Alain Boublil', 'Henri La Barthe', 'James Norman Hall', 'Jean Renoir', 'René Clair', 'Raymond Bernard', 'Rosalind Keating Shaffer', 'William Nicholson', \"John O'Hara\", 'Jay Dratler', 'Charles Nordhoff', 'Howard Harris', 'Gladys Hurlbut', 'Émile Zola', 'William Bowers', 'Julien Duvivier', 'Jacques Prévert', 'Antoine Blondin', 'Ralph Spence']\n",
      "[]\n",
      "\n",
      "422 what were the release dates of movies starred by actors in [Count Three and Pray]\n",
      "MATCH (m:Movie)-[r]-(a:Actor) WHERE toLower(a.name) = toLower('Count Three and Pray') RETURN DISTINCT m.release_year\n",
      "['1960', '1972', '1987', '1948', '1949', '1969', '1981', '1942', '1943', '1966', '1941', '1946', '1947', '1962', '1963', '1955', '1954', '1957', '1956', '1951', '1950', '1953', '1959', '1958', '1991', '1961', '1975', '1973', '1931', '1971', '1970', '2000', '2006']\n",
      "[]\n",
      "\n",
      "424 what are the languages spoken in the movies written by [Period of Adjustment] writers\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(l:Language) WHERE toLower(w.name) = toLower('Period of Adjustment') RETURN DISTINCT l.name\n",
      "['English', 'Italian']\n",
      "[]\n",
      "\n",
      "427 the films that share actors with the film [The Interpreter] were released in which years\n",
      "MATCH (m1:Movie)-[r1]-(a:Actor)-[r2]-(m2:Movie) WHERE toLower(m1.name) = toLower('The Interpreter') AND m2 <> m1 RETURN DISTINCT m2.release_year\n",
      "['1945', '1986', '1984', '1985', '1982', '1983', '1981', '1988', '1989', '2014', '2011', '2010', '2013', '2012', '1955', '1949', '1991', '1990', '1993', '1992', '1995', '1997', '1996', '1999', '1998', '1975', '2002', '2003', '2001', '2006', '2007', '2004', '2005', '2008', '2009']\n",
      "[['2001'], ['1991'], ['1998'], ['1990'], ['1996'], ['2012'], ['1995'], ['2007'], ['2011', '1992'], ['2005', '1945'], ['1989'], ['1993'], ['1975', '2004'], ['2011'], ['2003'], ['2004'], ['2013'], ['2010'], ['1997'], None, ['2009'], ['2014'], ['2002'], ['1992'], ['1986'], ['1981'], ['1983', '2003', '1995'], ['2006', '1949'], ['1982'], ['2008'], ['1988'], ['1985'], ['1984'], ['1955', '1989'], ['2005'], ['1999'], ['1990', '2010']]\n",
      "\n",
      "428 what were the release dates of films directed by the director of [Sorority Babes in the Slimeball Bowl-O-Rama]\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(m.name) = toLower('Sorority Babes in the Slimeball Bowl-O-Rama') MATCH (o:Movie)-[r2]-(d) RETURN DISTINCT o.release_year\n",
      "['1999', '1998', '1997', '2004']\n",
      "[['1999'], ['2004'], ['1988'], ['1998'], ['1997']]\n",
      "\n",
      "431 what are the languages spoken in the movies starred by [Minnie and Moskowitz] actors\n",
      "MATCH (a:Actor)-[r]-(m:Movie)-[r2]-(l:Language) WHERE toLower(a.name) = toLower('Minnie and Moskowitz') RETURN DISTINCT l.name\n",
      "['Hungarian', 'Italian']\n",
      "[]\n",
      "\n",
      "433 what were the release dates of films written by the screenwriter of [Prince Valiant]\n",
      "MATCH (ad:Movie)-[r1]-(w:Writer) WHERE toLower(ad.name) = toLower('Prince Valiant') MATCH (m:Movie)-[r2]-(w) RETURN DISTINCT m.release_year\n",
      "['2001', '2005']\n",
      "[['2005'], ['2001'], ['1997']]\n",
      "\n",
      "436 who is listed as screenwriter of the movies directed by the [Something Wicked This Way Comes] director\n",
      "MATCH (m:Movie)-[r1]-(d:Director),(m)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('Something Wicked This Way Comes') RETURN DISTINCT w.name\n",
      "['Peter Nelson', 'Cyril Hume', 'William Archibald', 'Harold Pinter', 'Owen Davis', 'Neil Paterson', 'Baz Luhrmann', 'F. Scott Fitzgerald', 'Richard Maibaum', 'Francis Ford Coppola', 'Penelope Mortimer', 'Henry James', 'John Braine', 'Brian Moore']\n",
      "[]\n",
      "\n",
      "437 which person wrote the movies starred by the actors in [Kiss of the Dragon]\n",
      "MATCH (a:Actor)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(a.name) = toLower('Kiss of the Dragon') RETURN DISTINCT w.name\n",
      "['Cameron Crowe', 'John Fusco', 'Anne Amanda Opotowsky', 'John Lutz', 'Paul Thomas Anderson', 'Sylvester Stallone', 'Rafael Yglesias', 'William Brookfield', 'Elmore Leonard', 'Robert Mundi', 'Ken Kaufman', 'Quentin Tarantino', 'James Wong', 'James Hadley Chase', 'Richard Wenk', 'David Agosto', 'Alan Parker', 'Dwight Yoakam', 'David E. Kelley', 'Kaja Blackley', 'Clare Peploe', 'Gordon Chan', 'Chris Roberts', 'Luc Besson', 'T. Coraghessan Boyle']\n",
      "[]\n",
      "\n",
      "440 when did the movies written by [Four Daughters] writers release\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(w.name) = toLower('Four Daughters') RETURN DISTINCT m.release_year\n",
      "['1934', '1949', '1983', '1932', '1972', '1961', '1966', '1941', '1946', '1931', '1944', '1947', '1954', '2000', '1964', '1952', '1938', '1959', '1958']\n",
      "[]\n",
      "\n",
      "443 who starred in the films whose directors also directed [Step Up]\n",
      "MATCH (m2:Movie) WHERE toLower(m2.name) = toLower('Step Up') MATCH (d:Director)-[r1]-(m2) MATCH (m:Movie)-[r2]-(d) MATCH (a:Actor)-[r3]-(m) RETURN DISTINCT a.name\n",
      "['Sandra Bullock', 'Barbra Streisand', 'Craig T. Nelson', 'Mary Steenburgen', 'Seth Rogen', 'Ryan Reynolds']\n",
      "['Jenna Dewan Tatum', 'Channing Tatum', 'Barbra Streisand', 'Seth Rogen', 'Mary Steenburgen', 'Ryan Reynolds', 'Sandra Bullock', 'Craig T. Nelson']\n",
      "\n",
      "446 what types are the films starred by actors in [Mysterious Mr. Moto]\n",
      "MATCH (m:Movie)-[r1]-(a:Actor), (m)-[r2]-(g:Genre) WHERE toLower(m.name) = toLower('Mysterious Mr. Moto') RETURN DISTINCT g.name\n",
      "['Mystery', 'Horror', 'Crime', 'Drama', 'Musical', 'Adventure', 'Comedy', 'War', 'Thriller']\n",
      "[]\n",
      "\n",
      "455 who starred films for the screenwriter of [Top Hat]\n",
      "MATCH (m:Movie)-[r1]-(w:Writer) WHERE toLower(m.name) = toLower('Top Hat') MATCH (w)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Alan Ladd', 'Mary Beth Hurt', 'Sydney Greenstreet', 'Katharine Hepburn', 'Jeremy Irons', 'Alexis Smith', 'Alexis Minotis', 'Fred Astaire', 'Clifton Webb', 'Michael McKean', 'Forest Whitaker', 'Sophia Loren', 'Carole Landis', 'Jason Priestley', 'Randolph Scott', 'Ginger Rogers', 'Franchot Tone', 'Victor Mature', 'Alice Brady', 'Humphrey Bogart', 'Harriet Hilliard', 'Betty Grable', 'Edward Everett Horton']\n",
      "['Randolph Scott', 'Fred Astaire', 'Harriet Hilliard', 'Ginger Rogers', 'Clifton Webb', 'Alan Ladd', 'Alexis Minotis', 'Sophia Loren', 'Sydney Greenstreet', 'Alexis Smith', 'Humphrey Bogart', 'Alice Brady', 'Edward Everett Horton', 'Victor Mature', 'Carole Landis', 'Betty Grable', 'Erik Rhodes', 'Forest Whitaker', 'Jason Priestley', 'Jeremy Irons', 'Michael McKean', 'Mary Beth Hurt', 'Katharine Hepburn', 'Franchot Tone']\n",
      "\n",
      "456 who acted in the movies written by the writer of [The Method]\n",
      "MATCH (m_ad:Movie)-[r1]-(w:Writer) WHERE toLower(m_ad.name) = toLower('The Method') MATCH (w)-[r2]-(m:Movie) MATCH (m)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Ricardo Darín', 'Héctor Alterio', 'Leonardo Sbaraglia', 'Cecilia Dopazo', 'Cecilia Roth']\n",
      "['Najwa Nimri', 'Pablo Echarri', 'Eduard Fernández', 'Eduardo Noriega', 'Cecilia Roth', 'Ricardo Darín', 'Héctor Alterio', 'Leonardo Sbaraglia', 'Cecilia Dopazo']\n",
      "\n",
      "457 what genres are the films starred by [Shoot to Kill] actors\n",
      "MATCH (a:Actor)-[r1]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(a.name) = toLower('Shoot to Kill') RETURN DISTINCT g.name\n",
      "['Mystery', 'Romance', 'Short', 'Family', 'Horror', 'Crime', 'Drama', 'Fantasy', 'Animation', 'Music', 'Adventure', 'Action', 'Comedy', 'War', 'Thriller', 'Western']\n",
      "[]\n",
      "\n",
      "463 what are the primary languages in the movies starred by actors in [Big Bad Mama]\n",
      "MATCH (m:Movie)-[r1]-(l:Language), (m:Movie)-[r2]-(a:Actor) WHERE toLower(m.name) = toLower('Big Bad Mama') RETURN DISTINCT l.name\n",
      "['Russian', 'Korean', 'Esperanto', 'French']\n",
      "[]\n",
      "\n",
      "467 who is listed as screenwriter of the films starred by [The Towering Inferno] actors\n",
      "MATCH (a:Actor)-[r]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(a.name) = toLower('The Towering Inferno') RETURN DISTINCT w.name\n",
      "['Henrik Ibsen', 'Emir Kusturica', 'F. Hugh Herbert', 'Frank Darabont', 'Richard Russo', 'David Rayfiel', 'Ron Shelton', 'Irving Ravetch', 'John Patrick', 'Thomas Berger', 'James Poe', 'Robert Getchell', 'Roy N. Sickner', 'Jonathan Finn', 'Ethan Coen', 'Han Suyin', 'Ken Kesey', 'Thornton Wilder', 'David S. Ward', 'Jonathan Tolins', 'Robert Rossen', 'Warren Duff', 'Larry McMurtry', 'Robert Stone', 'Leonard Praskins', 'Frank Perry', 'Rod Serling', 'Henri Charrière', 'Cameron Hawley', 'Michael Keon', 'Blake Edwards', 'Clifford Odets', 'Harry Kleiner', 'Frank Pierson', 'Ring Lardner Jr.', 'Christina Crawford', 'Stephenie Meyer', 'Wanda Tuchock', 'William Faulkner', 'Bruce Graham', 'Chuck Russell', 'Walter Hill', 'Melissa Rosenberg', 'Richard Brooks', 'Albert Mannheimer', 'Lawrence Sanders', 'Julia Leigh', \"John O'Hara\", 'Frances Marion', 'Arthur Kopit', 'Melville Shavelson', 'Robert Benton', 'Terry Southern', 'Rafi Pitts', 'John Milius', 'David Beaird', 'Blaze Starr', 'Harold Pinter', 'Andrew Birkin', 'Tracy Hotchner', 'Richard Jessup', 'Frank Yablans', 'Mann Rubin', 'Garson Kanin', 'Sidney Carroll', 'Gore Vidal', 'Sam Raimi', 'Peter Milne', 'Samuel A. Taylor', 'John Lee Mahin', 'Donald Bevan', 'Charles Bukowski', 'E. Max Frye', 'Robert Anderson', 'Harry Chandlee', 'Lewis E. Lawes', 'Ernest Lehman', 'Huey Perry', 'Joe Ranft', 'Walter Tevis', 'Frank Craven', 'Daniel Taradash', 'Israel Zangwill', 'John Lasseter', 'Horton Foote', 'Jim Thompson', 'Pierre Boulle', 'Jo Heims', 'Arnold Schulman', 'Paul Brickhill', 'Leo McCarey', 'Stefan Zweig', 'Nicholas Sparks', 'Alexander Klein', 'Robert Towne', 'Tinto Brass', 'Edwin Blum', 'Paddy Chayefsky', 'Harold Flender', 'Edmund Trzcinski', 'Elmore Leonard', 'Walter Bernstein', 'John Gay', 'Richard McKenna', 'Barry Reed', 'Douglas McGrath', 'Beth Henley', 'Robert Altman', 'Robert L. Fish', 'Bonnie Hunt', 'Max Shulman', 'George Axelrod', 'Elia Kazan', 'Courtney Ryley Cooper', 'Jan de Hartog', 'Walon Green', 'Lorenzo Semple Jr.', 'Martin Rackin', 'David Mamet', 'Billy Wilder', 'Terrence Malick', 'Harold Sinclair', 'Ross Macdonald', 'John Carpenter', 'George Seaton', 'Tennessee Williams', 'Arthur Miller', 'Donn Pearce', 'Paul Osborn', 'Barbara Benedek', 'David Newman', 'Nancy Dowd', 'Daniel Nettheim', 'Julien Duvivier', 'John Hopkins', 'Irving Wallace', 'Henri Jeanson', 'William Inge', 'Richard Mason', 'Leslie Stevens', 'Sam Peckinpah', 'Brian Moore', 'Margaret Atwood', 'Richard Price', 'William Goldman', 'James Grady', 'Thomas B. Costain']\n",
      "[]\n",
      "\n",
      "470 who is listed as screenwriter of the films directed by the [Stray Dog] director\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('Stray Dog') RETURN DISTINCT w.name\n",
      "['Ingmar Bergman', 'Akira Kurosawa', 'Tsuneo Tomita']\n",
      "[]\n",
      "\n",
      "472 what were the release years of the movies that share actors with the movie [The Infidel]\n",
      "MATCH (m:Movie)-[r]-(a:Actor) WHERE toLower(a.name) = toLower('The Infidel') RETURN DISTINCT m.release_year\n",
      "['2010']\n",
      "[]\n",
      "\n",
      "479 what types are the movies written by the screenwriter of [Shanghai Surprise]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Shanghai Surprise') WITH w MATCH (w:Writer)-[r]-(m2:Movie) WITH m2 MATCH (m2:Movie)-[r]-(g:Genre) RETURN DISTINCT g.name\n",
      "['Horror', 'Thriller']\n",
      "['Thriller', 'Horror', 'Adventure']\n",
      "\n",
      "483 what are the languages spoken in the films starred by [The Bourne Supremacy] actors\n",
      "MATCH (a:Actor)-[r1]-(m:Movie)-[r2]-(l:Language) WHERE toLower(a.name) = toLower('The Bourne Supremacy') RETURN DISTINCT l.name\n",
      "['German', 'English']\n",
      "[]\n",
      "\n",
      "485 what are the languages spoken in the movies whose writers also wrote [Dog Nail Clipper]\n",
      "MATCH (ad:Movie) WHERE toLower(ad.name) = toLower('Dog Nail Clipper') MATCH (w:Writer)-[r]-(ad) MATCH (m:Movie)-[r]-(w) MATCH (m)-[r]-(l:Language) RETURN DISTINCT l.name\n",
      "['Finnish']\n",
      "[]\n",
      "\n",
      "487 when did the movies directed by the [The Magic Flute] director release\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) = toLower('The Magic Flute') UNWIND m.release_year AS release_year RETURN DISTINCT release_year\n",
      "['1914', '1946', '1989', '1984', '1949', '1968', '1969', '1980', '1964', '1966', '1960', '1961', '1963', '2015', '2011', '2010', '2012', '1948', '1955', '1954', '1957', '1951', '1950', '1953', '1982', '1958', '1991', '1990', '1993', '1992', '1994', '1997', '1978', '1976', '1996', '1972', '2003', '2000', '2006', '2007', '2009']\n",
      "[]\n",
      "\n",
      "488 what genres are the films directed by the [Milk] director\n",
      "MATCH (d:Director)-[r]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(d.name) = toLower('Milk') RETURN DISTINCT g.name\n",
      "['Mystery', 'Romance', 'Horror', 'Crime', 'Drama', 'Comedy', 'Thriller']\n",
      "[]\n",
      "\n",
      "489 what were the release years of the films that share actors with the film [Naked Weapon]\n",
      "MATCH (m:Movie)-[r]-(a:Actor) WHERE toLower(a.name) = toLower('Naked Weapon') RETURN DISTINCT m.release_year\n",
      "['2006', '2011', '2013']\n",
      "[]\n",
      "\n",
      "490 what are the languages spoken in the films directed by the [I Was a Male War Bride] director\n",
      "MATCH (m:Movie)-[r1]-(d:Director), (m:Movie)-[r2]-(l:Language) WHERE toLower(d.name) = toLower('I Was a Male War Bride') RETURN DISTINCT l.name\n",
      "['Swahili', 'German']\n",
      "[]\n",
      "\n",
      "496 what are the languages spoken in the films written by [Tokyo Sonata] screenwriters\n",
      "MATCH (m:Movie)-[r1]-(w:Writer) WHERE toLower(w.name) = toLower('Tokyo Sonata') MATCH (m)-[r2]-(l:Language) RETURN DISTINCT l.name\n",
      "['Japanese', 'Flemish']\n",
      "[]\n",
      "\n",
      "498 what are the languages spoken in the movies directed by the [Vengo] director\n",
      "MATCH (d:Director)-[r]-(m:Movie)-[r2]-(l:Language) WHERE toLower(d.name) = toLower('Vengo') RETURN DISTINCT l.name\n",
      "['French']\n",
      "[]\n",
      "\n"
     ]
    }
   ],
   "source": [
    "for wrong in wrong_answers:\n",
    "    id_wrong = wrong[0]\n",
    "    print(id_wrong, df['question'][id_wrong])\n",
    "    print(df['answer_unmasked'][id_wrong])\n",
    "    print(wrong[1])\n",
    "    print(wrong[2])\n",
    "    print()\n",
    "        "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "60f2a885-bc03-4f1f-9adc-e33246a46fe5",
   "metadata": {},
   "source": [
    "### No Synonym"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "f5b5b966-30aa-4219-87b7-5e8f16d395c9",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|█████████████████████████████████████████████████████████████████████████████████| 502/502 [00:27<00:00, 18.12it/s]\n"
     ]
    }
   ],
   "source": [
    "parsed_results_no = run_cypher(list(df_no['answer_unmasked']), URI, AUTH)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "2a389429-25db-477d-9982-0cfcb5614d1c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Accuracy: 0.7370517928286853\n",
      "#Errors: 132\n"
     ]
    }
   ],
   "source": [
    "acc_no, wrong_answers_no = accuracy_score(sample_answers[1:], parsed_results_no)\n",
    "print(\"Accuracy:\", acc_no)\n",
    "print(\"#Errors:\", len(wrong_answers_no))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "0d0cc3d5-c2b2-4b39-a0bf-5d633eac9f53",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "True accuracy:  0.8027888446215139\n"
     ]
    }
   ],
   "source": [
    "print(\"True accuracy: \", ((502 - len(wrong_answers_no) + 33) / 502))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "19f2b3a2-b0ec-4e08-a6f8-210adebd7d18",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "29 the film [Pennies from Heaven] starred which actors\n",
      "MATCH (m:Movie)-[r]-(a:Actor) WHERE toLower(m.name) = toLower('Pennies from Heaven') RETURN DISTINCT a.name\n",
      "['Bing Crosby', 'Louis Armstrong', 'Madge Evans', 'Edith Fellows']\n",
      "['Madge Evans', 'Bing Crosby', 'Steve Martin', 'Louis Armstrong', 'Bernadette Peters', 'Edith Fellows', 'Jessica Harper']\n",
      "\n",
      "63 what was the genre of the film [Bad Boys]\n",
      "MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(m.name) = toLower('Bad Boys') RETURN DISTINCT g.name\n",
      "['Drama', 'Crime']\n",
      "['Drama', 'Comedy', 'Crime', 'Action']\n",
      "\n",
      "73 which topics is movie [Burden of Dreams] about\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Burden of Dreams') UNWIND coalesce(m.has_tags, []) AS topic RETURN DISTINCT topic UNION MATCH (m:Movie) WHERE toLower(m.name) = toLower('Burden of Dreams') UNWIND coalesce(m.has_genre, []) AS topic RETURN DISTINCT topic UNION MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(m.name) = toLower('Burden of Dreams') RETURN DISTINCT g.name AS topic\n",
      "['bd-r', 'south america', 'werner herzog', 'jungle', '3']\n",
      "['bd-r', 'south america', 'werner herzog', 'jungle', '3', 'Documentary']\n",
      "\n",
      "75 what topics is [Free Willy] about\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Free Willy') UNWIND coalesce(m.has_tags, []) AS topic RETURN DISTINCT topic UNION MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(m.name) = toLower('Free Willy') RETURN DISTINCT g.name AS topic\n",
      "['family']\n",
      "['family', 'Drama', 'Family']\n",
      "\n",
      "76 what are some words that describe movie [Linsanity]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Linsanity') UNWIND coalesce(m.has_tags, []) AS word RETURN DISTINCT word UNION MATCH (m:Movie) WHERE toLower(m.name) = toLower('Linsanity') UNWIND coalesce(m.has_genre, []) AS word RETURN DISTINCT word UNION MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(m.name) = toLower('Linsanity') AND g.name IS NOT NULL RETURN DISTINCT g.name AS word\n",
      "['basketball']\n",
      "['basketball', 'Documentary']\n",
      "\n",
      "79 can you give a few words describing what [Jeff, Who Lives at Home] is about\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Jeff, Who Lives at Home') OPTIONAL MATCH (m)-[r]-(g:Genre) WITH m, COLLECT(DISTINCT g.name) AS genreNames WITH m, genreNames + CASE WHEN m.has_tags IS NULL THEN [] ELSE m.has_tags END AS words UNWIND words AS word RETURN DISTINCT word\n",
      "['jason segel', 'judy greer', 'mark duplass']\n",
      "['Drama', 'Comedy', 'jason segel', 'judy greer', 'mark duplass']\n",
      "\n",
      "80 describe [The Butcher Boy]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('The Butcher Boy') RETURN DISTINCT m.name AS movie, m.release_year AS release_year, m.has_imdb_rating AS imdb_rating, m.has_imdb_votes AS imdb_votes, m.has_tags AS tags, [ (m)-[r]-(g:Genre) | g.name ] AS genres, [ (m)-[r]-(d:Director) | d.name ] AS directors, [ (m)-[r]-(w:Writer) | w.name ] AS writers, [ (m)-[r]-(a:Actor) | a.name ] AS actors, [ (m)-[r]-(l:Language) | l.name ] AS languages\n",
      "['neil jordan']\n",
      "['The Butcher Boy', ['1997'], None, None, ['neil jordan'], ['Drama'], ['Neil Jordan'], ['Neil Jordan'], ['Eamonn Owens'], []]\n",
      "\n",
      "81 which topics is [Death Wish] about\n",
      "MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(m.name) = toLower('Death Wish') RETURN DISTINCT g.name\n",
      "['vigilante', 'charles bronson', 'michael winner']\n",
      "['Drama', 'Crime', 'Action']\n",
      "\n",
      "84 can you give a few words describing [The Iron Horse]\n",
      "MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(m.name) = toLower('The Iron Horse') RETURN DISTINCT g.name\n",
      "['john ford', 'silent']\n",
      "[]\n",
      "\n",
      "85 describe [Riot in Cell Block 11] in a few words\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Riot in Cell Block 11') MATCH (m)-[r]-(g:Genre) RETURN DISTINCT g.name\n",
      "['don siegel']\n",
      "['Drama']\n",
      "\n",
      "88 who was the writer of the film [Molière]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Molière') RETURN DISTINCT w.name\n",
      "['Ariane Mnouchkine']\n",
      "['Ariane Mnouchkine', 'Grégoire Vigneron', 'Laurent Tirard']\n",
      "\n",
      "93 which person wrote the movie [Ned Kelly]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Ned Kelly') RETURN DISTINCT w.name\n",
      "['Tony Richardson']\n",
      "['John Michael McDonagh', 'Tony Richardson', 'Robert Drewe']\n",
      "\n",
      "101 who in the world wrote [Journey to the Center of the Earth]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Journey to the Center of the Earth') RETURN DISTINCT w.name\n",
      "['Rusty Lemorande']\n",
      "['Jules Verne', 'Rusty Lemorande', 'Charles Brackett']\n",
      "\n",
      "106 what was the release date of [The Man Who Laughs]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('The Man Who Laughs') RETURN DISTINCT m.release_year\n",
      "['2012']\n",
      "[['2012', '1928']]\n",
      "\n",
      "110 when was the movie [Stardust] released\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Stardust') RETURN DISTINCT m.release_year\n",
      "['2007']\n",
      "[['2007', '1974']]\n",
      "\n",
      "116 what year was [Doppelganger] released\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Doppelganger') RETURN DISTINCT m.release_year\n",
      "['2003']\n",
      "[['1993', '2003']]\n",
      "\n",
      "120 which films are about [shahrukh khan]\n",
      "MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(g.name) = toLower('shahrukh khan') RETURN DISTINCT m.name\n",
      "['My Name Is Khan', 'Dilwale Dulhania Le Jayenge', 'Chennai Express', 'Om Shanti Om', 'Mohabbatein', 'Duplicate']\n",
      "[]\n",
      "\n",
      "123 which movies can be described by [jason reitman]\n",
      "MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(g.name) = toLower('jason reitman') RETURN DISTINCT m.name\n",
      "['Juno', 'Up in the Air', 'Thank You for Smoking', 'Young Adult', 'Labor Day']\n",
      "[]\n",
      "\n",
      "128 which films can be described by [mother]\n",
      "MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(g.name) = toLower('mother') RETURN DISTINCT m.name\n",
      "['Incendies']\n",
      "[]\n",
      "\n",
      "143 who are movie co-directors of [Delbert Mann]\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(m.name) = toLower('Delbert Mann') RETURN DISTINCT d.name\n",
      "['Franco Zeffirelli', 'Cary Fukunaga', 'Lewis Milestone', 'Robert Stevenson']\n",
      "[]\n",
      "\n",
      "156 what genres are the movies written by [Gene Wilder] in\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(w.name) CONTAINS toLower('Wilder') RETURN DISTINCT g.name\n",
      "['Comedy', 'Musical']\n",
      "['Comedy', 'Musical', 'Drama', 'Romance', 'War', 'Thriller']\n",
      "\n",
      "160 the films written by [Babaloo Mandel] starred which actors\n",
      "MATCH (m:Movie)-[r1]-(w:Writer) WHERE toLower(w.name) = toLower('Babaloo Mandel Mandel]') MATCH (m)-[r2]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Nancy Travis', 'Jason Robards', 'Dianne Wiest', \"Olivia d'Abo\", 'Eugene Levy', 'Joan Cusack', 'Steve Martin', 'Michael J. Fox', 'Kirk Douglas', 'Geena Davis', 'John Candy', 'Daryl Hannah', 'Billy Crystal', 'David Paymer', 'Daniel Stern', 'Patricia Wettig', 'Tom Hanks', 'Mary Steenburgen', 'Bruno Kirby', 'Uma Thurman', 'Natalie Portman', 'Stockard Channing', 'Dabney Coleman', 'Ashley Judd', 'Madonna', 'Lori Petty']\n",
      "[]\n",
      "\n",
      "161 what were the release years the films written by [Gary David Goldberg]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Gary David Goldberg') UNWIND m.release_year AS release_year RETURN DISTINCT release_year\n",
      "['2005', '1995', '1989']\n",
      "[]\n",
      "\n",
      "166 the films directed by [Deon Taylor] were in which genres\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(l:Language) WHERE toLower(d.name) = toLower('Taylor') RETURN DISTINCT l.name\n",
      "['Horror']\n",
      "[]\n",
      "\n",
      "169 when were the films directed by [Peter Lord] released\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) = toLower(replace('Lord]', ']', '')) RETURN DISTINCT m.release_year\n",
      "['2000']\n",
      "[]\n",
      "\n",
      "173 the movies directed by [Tony Bancroft] were written by who\n",
      "MATCH (d:Director)-[r]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(d.name) CONTAINS toLower('Bancroft') RETURN DISTINCT w.name\n",
      "['Raymond Singer', 'Robert D. San Souci', 'Philip LaZebnik', 'Chris Sanders', 'Rita Hsiao']\n",
      "['Arild Fröhlich', 'Anne Bancroft', 'Rita Hsiao', 'Robert D. San Souci', 'Chris Sanders', 'Philip LaZebnik', 'Raymond Singer']\n",
      "\n",
      "176 what were the release years the films directed by [Igor Meglic]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Igor Meglic') UNWIND m.release_year AS release_year RETURN DISTINCT release_year\n",
      "['2012']\n",
      "[]\n",
      "\n",
      "179 who are movie co-writers of [Al Pacino]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Al Pacino') RETURN DISTINCT w.name\n",
      "['William Shakespeare']\n",
      "[]\n",
      "\n",
      "191 which person wrote the movies directed by [Niki Caro]\n",
      "MATCH (d:Director)-[r]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('Niki Caro') RETURN DISTINCT w.name\n",
      "['Michael Seitzman', 'Clara Bingham', 'Witi Ihimaera', 'Laura Leedy']\n",
      "['Niki Caro', 'Witi Ihimaera', 'Clara Bingham', 'Michael Seitzman', 'Laura Leedy']\n",
      "\n",
      "201 the films written by [Alan Caillou] were released in which years\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(w.name) = toLower('Alan Caillou Caillou]') RETURN DISTINCT m.release_year\n",
      "['1977', '1989']\n",
      "[]\n",
      "\n",
      "205 who are the writers of the movies directed by [Jack Plotnick]\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('Jack Plotnick') RETURN DISTINCT w.name\n",
      "['Sam Pancake', 'Michael Stoyanov', 'Kali Rocha']\n",
      "['Kali Rocha', 'Sam Pancake', 'Jack Plotnick', 'Michael Stoyanov']\n",
      "\n",
      "208 the movies directed by [Sandor Stern] starred who\n",
      "MATCH (m:Movie)-[r]-(d:Director), (m:Movie)-[r2]-(a:Actor) WHERE toLower(d.name) = toLower('Stern') AND toLower(a.name) = toLower('Stern') RETURN DISTINCT m.name\n",
      "['David Hewlett', \"Terry O'Quinn\", 'Cynthia Preston']\n",
      "[]\n",
      "\n",
      "217 what were the release years of the movies written by [Tarik Saleh]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Tarik Saleh') RETURN DISTINCT m.release_year\n",
      "['2009']\n",
      "[]\n",
      "\n",
      "220 who are film co-writers of [Tim Burns]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Tim Burns') RETURN DISTINCT w.name\n",
      "['Alex Winter', 'Tom Stern']\n",
      "[]\n",
      "\n",
      "226 the movies written by [Mark Miller] starred who\n",
      "MATCH (m:Movie)-[r1]-(w:Writer), (m)-[r2]-(a:Actor) WHERE toLower(w.name) = toLower('Mark Miller') AND toLower(a.name) CONTAINS toLower('Miller') RETURN DISTINCT m.name\n",
      "['Donovan Scott', 'Keanu Reeves', 'Anthony Quinn', 'Bridgette Andersen', 'Giancarlo Giannini']\n",
      "['Savannah Smiles']\n",
      "\n",
      "230 when did the movies acted by [Ignat Daniltsev] release\n",
      "MATCH (a:Actor)-[r]-(m:Movie) WHERE toLower(a.name) = toLower('Ignat Daniltsev') RETURN DISTINCT m.name, m.release_year\n",
      "['1975', '1997']\n",
      "['The Mirror', ['1997', '1975']]\n",
      "\n",
      "231 when did the movies directed by [David Ondaatje] release\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) = toLower('Ondaatje') RETURN DISTINCT m.release_year\n",
      "['2009', '1944', '1927']\n",
      "[]\n",
      "\n",
      "242 the films written by [Laura Kirk] were directed by who\n",
      "MATCH (w:Writer)-[r]-(m:Movie)-[r2]-(d:Director) WHERE toLower(w.name) CONTAINS toLower('Kirk') RETURN DISTINCT d.name\n",
      "['Griffin Dunne']\n",
      "['Lee Kirk', 'Griffin Dunne', 'Henry Hathaway', 'Richard Fleischer', 'Jean Renoir', 'Karey Kirkpatrick', 'Tim Johnson', 'Michael Lehmann', 'Gary Winick', 'Tim Kirkman', 'Kirk Jones', 'Giuseppe Tornatore']\n",
      "\n",
      "243 what genres are the films written by [Dick Richards] in\n",
      "MATCH (w:Writer)-[r]-(m:Movie) WHERE toLower(w.name) STARTS WITH toLower('Dick Richards Richards') MATCH (m)-[r2]-(g:Genre) RETURN DISTINCT g.name\n",
      "['War']\n",
      "[]\n",
      "\n",
      "251 what were the release years of the movies directed by [Michael Anderson]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) IN [x IN split('Michael Anderson', ',') | toLower(trim(x))] UNWIND m.release_year AS year RETURN DISTINCT year\n",
      "['1986', '1968', '1977', '1976', '1966', '1960', '1961', '1989', '1955', '1956', '2007', '1965', '1959']\n",
      "[]\n",
      "\n",
      "255 the films directed by [Abhishek Jain] were in which languages\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(l:Language) WHERE toLower(d.name) = toLower('Abhishek Jain Jain]') RETURN DISTINCT l.name\n",
      "['Gujarati']\n",
      "[]\n",
      "\n",
      "257 when did the movies written by [Pekka Parikka] release\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(w.name) CONTAINS toLower('Parikka') UNWIND coalesce(m.release_year, []) AS year RETURN DISTINCT m.name, year ORDER BY year, m.name\n",
      "['1989']\n",
      "['The Winter War', '1989']\n",
      "\n",
      "258 who wrote the screenplay for the movies starred by [Chris Stapp]\n",
      "MATCH (a:Actor)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(a.name) = toLower('Chris Stapp') RETURN DISTINCT w.name\n",
      "['Matt Heath']\n",
      "['Chris Stapp', 'Matt Heath']\n",
      "\n",
      "271 what genres are the movies directed by [P.J. Hogan] in\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(d.name) = toLower('Hogan') RETURN DISTINCT g.name\n",
      "['Comedy']\n",
      "[]\n",
      "\n",
      "277 who is listed as screenwriter of [Susanna Fogel] directed films\n",
      "MATCH (m:Movie)-[r1]-(d:Director), (m)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('Susanna Fogel') RETURN DISTINCT w.name\n",
      "['Joni Lefkowitz']\n",
      "['Susanna Fogel', 'Joni Lefkowitz']\n",
      "\n",
      "280 the movies directed by [Bibo Bergeron] were in which languages\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) = toLower('Bibo Bergeron Bergeron]') MATCH (m)-[r2]-(l:Language) RETURN DISTINCT l.name\n",
      "['French']\n",
      "[]\n",
      "\n",
      "281 when did the films directed by [Ringo Lam] release\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) = toLower('Lam') UNWIND m.release_year AS release_year RETURN DISTINCT m.name, release_year ORDER BY release_year, m.name\n",
      "['1987', '1992', '1996', '2003', '2001', '2007', '2009']\n",
      "[]\n",
      "\n",
      "287 what genres do the movies written by [Raoul Walsh] fall under\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(w.name) CONTAINS toLower('Walsh') RETURN DISTINCT g.name\n",
      "['Drama', 'Crime']\n",
      "['Family', 'Fantasy', 'Drama', 'Thriller', 'Crime', 'Horror', 'Comedy', 'Musical']\n",
      "\n",
      "291 what genres do the films written by [Stacy Keach] fall under\n",
      "MATCH (w:Writer) WHERE toLower(w.name) = toLower('Stacy Keach Keach]') MATCH (m:Movie)-[r]-(w) MATCH (m)-[r2]-(g:Genre) RETURN DISTINCT g.name\n",
      "['Western']\n",
      "[]\n",
      "\n",
      "295 the films written by [Carol Ryrie Brink] were in which genres\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(l:Language) WHERE toLower(w.name) CONTAINS toLower('Brink') RETURN DISTINCT l.name\n",
      "['Drama']\n",
      "[]\n",
      "\n",
      "303 when did the films written by [Jacques Mayol] release\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(w.name) = toLower('Mayol') UNWIND m.release_year AS year RETURN DISTINCT year ORDER BY year\n",
      "['1988']\n",
      "[]\n",
      "\n",
      "312 the films directed by [John Pasquin] were released in which years\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) CONTAINS toLower('Pasquin') UNWIND m.release_year AS year RETURN DISTINCT year ORDER BY year\n",
      "['2001', '1994', '1997']\n",
      "['1994', '1997', '2001', '2010', '2014']\n",
      "\n",
      "313 the movies written by [Edward Levy] were released in which years\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(w.name) CONTAINS toLower('Levy') RETURN DISTINCT m.release_year\n",
      "['1982']\n",
      "[['2008'], ['2013'], ['2001'], ['2003'], None, ['2006'], ['1982'], ['1994'], ['1977']]\n",
      "\n",
      "316 the movies written by [Homer] were in which genres\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(l:Language) WHERE toLower(w.name) = toLower('Homer') RETURN DISTINCT l.name\n",
      "['Drama', 'Comedy', 'Adventure']\n",
      "['Italian']\n",
      "\n",
      "317 who are the writers of the films directed by [James Dearden]\n",
      "MATCH (m:Movie)-[r1]-(d:Director), (m:Movie)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('James Dearden') RETURN DISTINCT w.name\n",
      "['Lawrence Roman', 'Barry Unsworth', 'Nick Leeson', 'Ira Levin']\n",
      "['Lawrence Roman', 'James Dearden', 'Ira Levin', 'Nick Leeson', 'Barry Unsworth']\n",
      "\n",
      "319 what genres do the films directed by [Walter Salles] fall under\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(d.name) = toLower('Walter Salles Salles]') RETURN DISTINCT g.name\n",
      "['Horror', 'Drama', 'Adventure', 'Action', 'Comedy', 'Thriller']\n",
      "[]\n",
      "\n",
      "320 the movies written by [Costa Botes] were directed by who\n",
      "MATCH (w:Writer)-[r]-(m:Movie)-[r2]-(d:Director) WHERE toLower(w.name) = toLower('Costa Botes Botes]') RETURN DISTINCT d.name\n",
      "['Peter Jackson']\n",
      "[]\n",
      "\n",
      "321 the movies written by [Andrew Davies] were in which languages\n",
      "MATCH (w:Writer)-[r]-(m:Movie)-[r2]-(l:Language) WHERE toLower(w.name) = toLower('Andrew Davies Davies]') RETURN DISTINCT l.name\n",
      "['English']\n",
      "[]\n",
      "\n",
      "326 what are the main languages in [Madame de La Fayette] written films\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(l:Language) WHERE toLower(w.name) = toLower('Madame de La Fayette') RETURN l.name, count(DISTINCT m) AS frequency ORDER BY frequency DESC, l.name\n",
      "['French']\n",
      "['French', 1]\n",
      "\n",
      "327 the movies directed by [Kent Alterman] were in which genres\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(l:Language) WHERE toLower(d.name) = toLower('Kent Alterman Alterman]') RETURN DISTINCT l.name\n",
      "['Comedy', 'Sport']\n",
      "[]\n",
      "\n",
      "337 the films directed by [Jules Stewart] were written by who\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(d.name) CONTAINS toLower('Stewart') RETURN DISTINCT w.name\n",
      "['Jared Kurt']\n",
      "['Stanford Sherman', 'Stewart Raffill', 'Steve Feke', 'Rob Stewart', 'Jon Stewart', 'Maziar Bahari', 'Aimee Molloy', 'Jared Kurt', 'Jules Stewart', 'Scott Stewart', 'Peter Schink', 'Jimmy McGovern', 'Cory Goodman', 'Stewart Hopewell', 'Douglas Day Stewart', 'Pete Goldfinger', 'Josh Stolberg', 'Christopher Borrelli', 'Jason Kabolati']\n",
      "\n",
      "344 who is listed as screenwriter of [Raoul Ruiz] directed movies\n",
      "MATCH (d:Director)-[r]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('Raoul Ruiz') RETURN DISTINCT w.name\n",
      "['Gilbert Adair', 'Duane Poole']\n",
      "['Raoul Ruiz', 'Gilbert Adair', 'Duane Poole']\n",
      "\n",
      "348 who are film co-directors of [Edgar G. Ulmer]\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(m.name) = toLower('Edgar G. Ulmer') RETURN DISTINCT d.name\n",
      "['Catherine Breillat', 'Severin Eskeland', 'Edward Dmytryk']\n",
      "[]\n",
      "\n",
      "350 [Tim Burton] directed films together with who\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(co:Director) WHERE toLower(d.name) = toLower('Tim Burton') AND co <> d RETURN DISTINCT m.name, co.name\n",
      "['Mike Johnson', 'Franklin J. Schaffner', 'Norman Z. McLeod']\n",
      "['Planet of the Apes', 'Franklin J. Schaffner', 'Alice in Wonderland', 'Norman Z. McLeod', 'Corpse Bride', 'Mike Johnson']\n",
      "\n",
      "353 who starred movies for the director of [Written on the Wind]\n",
      "MATCH (m:Movie)-[r1]-(d:Director) WHERE toLower(m.name) = toLower('Written on the Wind') MATCH (d)-[r2]-(m2:Movie) MATCH (a:Actor)-[r3]-(m2) RETURN DISTINCT a.name\n",
      "['Sandra Dee', 'Charles Coburn', 'Cornel Wilde', 'John Gavin', 'Warren William', 'Susan Kohner', 'Joan Bennett', 'Fred MacMurray', 'Barbara Stanwyck', 'Don Ameche', 'Jane Wyman', 'Rochelle Hudson', 'Boris Karloff', 'Patricia Knight', 'Robert Cummings', 'Rock Hudson', 'Lucille Ball', 'Claudette Colbert', 'Lana Turner', 'George Sanders']\n",
      "['Barbara Stanwyck', 'Fred MacMurray', 'Joan Bennett', 'Robert Stack', 'Dorothy Malone', 'Rock Hudson', 'Lauren Bacall', 'Jane Wyman', 'Warren William', 'Sandra Dee', 'Rochelle Hudson', 'Lana Turner', 'Claudette Colbert', 'Susan Kohner', 'John Gavin', 'Patricia Knight', 'Cornel Wilde', 'Charles Coburn', 'Boris Karloff', 'George Sanders', 'Lucille Ball', 'Don Ameche', 'Robert Cummings']\n",
      "\n",
      "356 who is listed as director of the films starred by [The Inner Circle] actors\n",
      "MATCH (a:Actor)-[r1]-(m:Movie)-[r2]-(d:Director) WHERE toLower(a.name) = toLower('The Inner Circle') RETURN DISTINCT d.name\n",
      "['John Landis', 'Atom Egoyan', 'Gary Trousdale', 'Steven Spielberg', 'Louis Leterrier', 'Alan Alda', 'Nora Ephron', 'Wolfgang Petersen', 'Allen Coulter', 'Richard Benjamin', 'Orson Welles', 'Neil Jordan', 'William Dieterle', 'Stephen Frears', 'Peter Yates', 'Markus Schleinzer', 'Wayne Wang', 'Jean Delannoy', 'Robert Zemeckis', 'Guy Jenkin', 'Christopher Hampton', 'Jack Clayton', 'Rocky Morton', 'Annabel Jankel', 'Mike Hodges', 'Kirk Wise', 'Ellen Perry', 'John Byrum', 'Abel Ferrara', 'Robert M. Young']\n",
      "[]\n",
      "\n",
      "359 who are the directors of the movies written by the writer of [She]\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(d:Director) WHERE toLower(w.name) = toLower('She') RETURN DISTINCT d.name\n",
      "['Gary Nelson']\n",
      "[]\n",
      "\n",
      "362 when did the movies starred by [Jupiter Ascending] actors release\n",
      "MATCH (a:Actor)-[r]-(m:Movie) WHERE toLower(a.name) = toLower('Jupiter Ascending') RETURN DISTINCT m.release_year ORDER BY m.release_year ASC\n",
      "['2007', '2014', '2008', '2009', '2011', '2010', '2013', '2012']\n",
      "[]\n",
      "\n",
      "364 when did the films written by [Send Me No Flowers] writers release\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(w.name) = toLower('Send Me No Flowers Flowers]') RETURN DISTINCT m.release_year\n",
      "['1983', '1932', '1966', '1941', '1972', '1944', '1961', '1954', '1938', '1958']\n",
      "[]\n",
      "\n",
      "366 what genres are the movies starred by [Trog] actors\n",
      "MATCH (a:Actor)-[r1]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(a.name) = toLower('Trog') RETURN DISTINCT g.name\n",
      "['Horror', 'Drama', 'Fantasy', 'Music', 'Western', 'Comedy', 'Musical', 'Thriller']\n",
      "[]\n",
      "\n",
      "370 who starred films for the director of [Flickering Lights]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Flickering Lights') MATCH (m)-[r]-(d:Director) MATCH (d)-[r2]-(f:Movie) MATCH (f)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Mads Mikkelsen', 'Ulrich Thomsen', 'Line Kruse', 'Nikolaj Lie Kaas']\n",
      "['Mads Mikkelsen', 'Ulrich Thomsen', 'Nikolaj Lie Kaas', 'Line Kruse', 'Søren Pilmark']\n",
      "\n",
      "378 who are the directors of films whose writers also wrote [People Like Us]\n",
      "MATCH (adhoc:Movie) WHERE toLower(adhoc.name) = toLower('People Like Us') MATCH (w:Writer)-[r1]-(adhoc) MATCH (m:Movie)-[r2]-(w) MATCH (m)-[r3]-(d:Director) RETURN DISTINCT d.name\n",
      "['Marc Webb', 'Michael Bay']\n",
      "['Michael Bay', 'Marc Webb', 'Alex Kurtzman']\n",
      "\n",
      "380 the films written by the writer of [Lions for Lambs] starred who\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(w.name) = toLower('Lions for Lambs Lambs]') RETURN DISTINCT m.name\n",
      "['Rachel McAdams', 'Ben Affleck', 'Brad Pitt', 'Russell Crowe', 'Jennifer Garner', 'Jamie Foxx', 'Chris Cooper', 'Jason Bateman', 'Helen Mirren']\n",
      "[]\n",
      "\n",
      "381 what are the genres of the films whose screenwriters also wrote [Summer Hours]\n",
      "MATCH (adhoc:Movie)-[r1]-(w:Writer) WHERE toLower(adhoc.name) = toLower('Summer Hours') MATCH (m:Movie)-[r2]-(w) MATCH (m)-[r3]-(g:Genre) RETURN DISTINCT g.name\n",
      "['Drama', 'Thriller']\n",
      "['Drama', 'Thriller', 'Family']\n",
      "\n",
      "382 what were the release dates of films starred by actors in [The Teahouse of the August Moon]\n",
      "MATCH (m:Movie)-[r]-(a:Actor) WHERE toLower(m.name) = toLower('The Teahouse of the August Moon') MATCH (a)-[r2]-(f:Movie) RETURN DISTINCT f.release_year\n",
      "['1953', '1925', '1984', '1968', '1969', '1980', '1964', '1965', '1966', '1967', '1960', '1961', '1962', '1963', '1955', '1954', '1957', '1951', '1950', '1935', '1952', '1997', '1958', '1990', '1995', '1994', '1979', '1996', '1977', '1976', '1978', '1972', '2001', '2006']\n",
      "[['1964'], ['1978'], ['1972'], ['1976'], ['1954'], ['1960'], ['1968'], ['1967'], ['1968', '2006'], ['1955'], ['1956'], ['1965'], ['1980'], ['1977', '1996'], ['1961'], ['1990', '1925'], ['1979'], ['1962', '1935'], ['1953'], None, ['1952'], ['1963'], ['1957'], ['1966'], ['1950'], ['1966', '1994'], ['1951', '1984', '1995'], ['1958'], ['1969'], ['1997'], ['2001']]\n",
      "\n",
      "383 who are the actors in the films directed by the director of [The Mirror Has Two Faces]\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(a:Actor) WHERE toLower(d.name) = toLower('The Mirror Has Two Faces') RETURN DISTINCT a.name\n",
      "['Barbra Streisand', 'Nick Nolte']\n",
      "[]\n",
      "\n",
      "389 what types are the films directed by the director of [Min and Bill]\n",
      "MATCH (d:Director)-[r]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(d.name) = toLower('Min and Bill') RETURN DISTINCT g.name\n",
      "['Crime']\n",
      "[]\n",
      "\n",
      "391 who acted in the films directed by the director of [The Stupids]\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(a:Actor) WHERE toLower(d.name) = toLower('The Stupids') RETURN DISTINCT a.name\n",
      "['Tom Hulce', 'Ornella Muti', 'David Proval', 'Chazz Palminteri', 'David Naughton', 'Griffin Dunne', 'Sylvester Stallone', 'Steve Martin', 'Martin Short', 'Donna Dixon', 'Chevy Chase', 'Cab Calloway', 'Monique Gabrielle', 'David Zucker', 'Michelle Pfeiffer', 'John Amos', 'James Earl Jones', 'Steve Forrest', 'Eddie Murphy', 'Jeff Goldblum', 'Dan Aykroyd', 'Anne Parillaud', 'Denholm Elliott', 'James Brown', 'John Belushi', 'Arsenio Hall']\n",
      "[]\n",
      "\n",
      "392 what were the release dates of movies written by the writer of [Mary and Martha]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(w.name) = toLower('Mary and Martha') UNWIND coalesce(m.release_year, []) AS release_year RETURN DISTINCT release_year\n",
      "['1994', '1997', '1999', '1989', '2003', '2005', '2014', '1970', '2013']\n",
      "[]\n",
      "\n",
      "396 what genres are the films written by [Mac and Me] screenwriters\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(w.name) = toLower('Mac and Me Me]') RETURN DISTINCT g.name\n",
      "['Drama', 'Adventure']\n",
      "[]\n",
      "\n",
      "398 which person directed the movies starred by the actors in [Common]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Common') MATCH (m)-[r1]-(a:Actor) MATCH (a)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(d:Director) RETURN DISTINCT d.name\n",
      "['Robert Altman', 'Tim Burton', 'David Hare', 'John Irvin', 'Karel Reisz', 'Kevin Costner', 'Rupert Wyatt', 'John Frankenheimer', 'Scott Michell', 'Barry Levinson', 'Károly Makk']\n",
      "['Tim Burton', 'John Frankenheimer', 'Barry Levinson', 'Robert Altman', 'Karel Reisz', 'David Hare', 'John Irvin', 'Károly Makk', 'Rupert Wyatt', 'David Blair', 'Scott Michell', 'Kevin Costner']\n",
      "\n",
      "400 who starred in the movies whose director also directed [What Ever Happened to Baby Jane?]\n",
      "MATCH (adhoc:Movie) WHERE toLower(adhoc.name) = toLower('What Ever Happened to Baby Jane?') MATCH (adhoc)-[r1]-(d:Director) MATCH (m:Movie)-[r2]-(d) MATCH (m)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Cesar Romero', 'Jeff Chandler', 'Richard Jaeckel', 'Joan Crawford', 'Ian Bannen', 'Frank Sinatra', 'Ida Lupino', 'Gary Cooper', 'Burt Lancaster', 'Dean Martin', 'Ben Johnson', 'Jim Brown', 'Bruce Davison', 'Catherine Deneuve', 'Harry Andrews', 'Kirk Douglas', 'Dorothy Malone', 'Burt Reynolds', 'Michael Caine', 'Peter Falk', 'Kim Novak', 'Hardy Krüger', 'Anita Ekberg', 'Ernest Borgnine', 'Gene Wilder', 'Joseph Cotten', 'Lee Marvin', 'Cliff Robertson', 'Eddie Albert', 'Martine Carol', 'Rock Hudson', 'Jean Hagen', 'Charles Bronson', 'Robert Strauss', 'Paul Winfield', 'Peter Finch', 'Ralph Meeker', 'Vicki Frederick', 'Harrison Ford', 'Ursula Andress', 'Wendell Corey', 'Denise Darcel', 'James Stewart', 'Jack Palance', 'Laurene Landon', 'Richard Attenborough']\n",
      "['Denise Darcel', 'Cesar Romero', 'Burt Lancaster', 'Gary Cooper', 'Gene Wilder', 'Harrison Ford', 'Anita Ekberg', 'Frank Sinatra', 'Ursula Andress', 'Dean Martin', 'Cliff Robertson', 'Joan Crawford', 'Richard Attenborough', 'Peter Finch', 'Hardy Krüger', 'James Stewart', 'Kirk Douglas', 'Rock Hudson', 'Joseph Cotten', 'Dorothy Malone', 'Michael Caine', 'Harry Andrews', 'Ian Bannen', 'Vicki Frederick', 'Peter Falk', 'Laurene Landon', 'Bette Davis', 'Ralph Meeker', 'Ida Lupino', 'Jack Palance', 'Jean Hagen', 'Wendell Corey', 'Ernest Borgnine', 'Kim Novak', 'Richard Jaeckel', 'Bruce Davison', 'Robert Strauss', 'Lee Marvin', 'Eddie Albert', 'Charles Bronson', 'Jim Brown', 'Jeff Chandler', 'Martine Carol', 'Catherine Deneuve', 'Ben Johnson', 'Burt Reynolds', 'Paul Winfield']\n",
      "\n",
      "403 when did the films directed by the [Return of the Fly] director release\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) = toLower('Return of the Fly Fly]') RETURN DISTINCT m.release_year\n",
      "['1956', '1958']\n",
      "[]\n",
      "\n",
      "404 when did the films starred by [Falling Down] actors release\n",
      "MATCH (m:Movie)-[r]-(a:Actor) WHERE toLower(a.name) = toLower('Falling Down') RETURN DISTINCT m.release_year\n",
      "['1997', '1926', '1987', '1984', '1985', '1983', '1981', '1988', '1989', '2014', '2011', '2013', '2012', '1956', '1969', '1991', '1990', '1993', '1992', '1995', '1994', '1979', '1996', '1977', '1998', '1975', '1978', '1973', '1972', '1971', '2002', '2003', '2000', '2001', '2006', '2007', '1976', '2008', '2009']\n",
      "[]\n",
      "\n",
      "405 what genres are the movies directed by the [Slumdog Millionaire] director\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(d.name) = toLower('Slumdog Millionaire Millionaire]') RETURN DISTINCT g.name\n",
      "['Drama', 'Comedy', 'Adventure', 'Thriller', 'Crime']\n",
      "[]\n",
      "\n",
      "406 the movies written by the screenwriter of [Frenchman's Creek] were directed by who\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(d:Director) WHERE toLower(w.name) = toLower('Frenchman's Creek Creek]') RETURN DISTINCT d.name\n",
      "['Charles Sturridge', 'Nicolas Roeg', 'Alfred Hitchcock', 'Henry Koster', 'Brian Desmond Hurst']\n",
      "[]\n",
      "\n",
      "407 the movies directed by the director of [Persona] starred who\n",
      "MATCH (m:Movie)-[r1]-(d:Director), (m)-[r2]-(a:Actor) WHERE toLower(d.name) = toLower('Persona') AND toLower(a.name) = toLower('Persona') RETURN DISTINCT m.name\n",
      "['Max von Sydow', 'Gunnel Lindblom', 'Erland Josephson', 'Brandon Quinn', 'Gunnar Björnstrand', 'Rita Russek', 'Mercedes McNab', 'Michael Fassbender', 'Ingrid Thulin', 'Liv Ullmann', 'Bengt Ekerot', 'Harriet Andersson', 'Lacey Chabert', 'Victor Sjöström', 'Cary Grant', 'Tygh Runyan', 'Bibi Andersson', 'Viggo Mortensen', 'Ingrid Bergman', 'José Ferrer', 'Lena Nyman']\n",
      "[]\n",
      "\n",
      "410 who directed the films written by the writer of [Green Dragon]\n",
      "MATCH (m:Movie)-[r1]-(w:Writer) WHERE toLower(w.name) = toLower('Green Dragon') MATCH (m)-[r2]-(d:Director) RETURN DISTINCT d.name\n",
      "['Timothy Linh Bui']\n",
      "[]\n",
      "\n",
      "411 the films written by the screenwriter of [Last Night] were directed by who\n",
      "MATCH (m:Movie)-[r1]-(w:Writer) WHERE toLower(w.name) = toLower('Last Night Night]') MATCH (m)-[r2]-(d:Director) RETURN DISTINCT d.name\n",
      "['John Maybury', 'François Girard', 'Fernando Meirelles']\n",
      "[]\n",
      "\n",
      "413 who are the actors in the films written by the screenwriter of [The Steel Helmet]\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(a:Actor) WHERE toLower(w.name) = toLower('The Steel Helmet') RETURN DISTINCT a.name\n",
      "['Jean Peters', 'Jeff Chandler', 'John Derek', 'Dolores Dorn', 'Brian Keith', 'Thelma Ritter', 'Michael Dante', 'Reed Hadley', 'Glenn Corbett', 'Mary Welch', 'Beatrice Kay', 'Al Lettieri', 'Rod Taylor', 'Broderick Crawford', 'Richard Widmark', 'Gene Evans', 'Barbara Stanwyck', 'Kristy McNichol', 'Lee Marvin', 'Cliff Robertson', 'John Ireland', 'Vincent Price', 'Richard Harris', 'Mark Hamill', 'Constance Towers', 'Rod Steiger', 'Barry Sullivan', 'Ralph Meeker', 'Donna Reed', 'James Shigeta', 'Anthony Eisley', 'Victoria Shaw']\n",
      "[]\n",
      "\n",
      "414 what are the genres of the films whose directors also directed [In the Name of the Law]\n",
      "MATCH (ad:Movie)-[r1]-(d:Director) WHERE toLower(ad.name) = toLower('In the Name of the Law') MATCH (m:Movie)-[r2]-(d) MATCH (m)-[r3]-(g:Genre) RETURN DISTINCT g.name\n",
      "['Comedy', 'Documentary']\n",
      "['Drama', 'Comedy', 'Documentary']\n",
      "\n",
      "415 who directed the movies written by the writer of [Little Nicky]\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(d:Director) WHERE toLower(w.name) = toLower('Little Nicky') RETURN DISTINCT d.name\n",
      "['Brian Robbins', 'Steven Brill', 'Dennis Dugan', 'Tamra Davis', 'Frank Coraci', 'Seth Kearsley']\n",
      "[]\n",
      "\n",
      "416 who is listed as director of the movies starred by [Solo] actors\n",
      "MATCH (a:Actor)-[r]-(m:Movie)-[r2]-(d:Director) WHERE toLower(a.name) = toLower('Solo') RETURN DISTINCT d.name\n",
      "['Jonathan Kesselman', 'Stuart Gillard', 'Daniel Petrie', 'Walter Hill', 'Joel Schumacher', 'Kirk Douglas', 'Gavin Wilding', 'Dave Parker', 'Anthony Hickox', 'Mario Van Peebles', 'Bruce Malmuth']\n",
      "[]\n",
      "\n",
      "417 the movies written by the screenwriter of [Sinbad and the Eye of the Tiger] starred who\n",
      "MATCH (m:Movie)-[r1]-(w:Writer), (m)-[r2]-(a:Actor) WHERE toLower(w.name) = toLower('Sinbad and the Eye of the Tiger Tiger]') AND toLower(a.name) = toLower('Sinbad and the Eye of the Tiger Tiger]') RETURN DISTINCT m.name\n",
      "['John Phillip Law']\n",
      "[]\n",
      "\n",
      "418 who are the directors of the films written by the writer of [Two for the Road]\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(d:Director) WHERE toLower(w.name) = toLower('Two for the Road') RETURN DISTINCT d.name\n",
      "['John Schlesinger', 'Peter Bogdanovich', 'Stanley Kubrick', 'Johan Kling']\n",
      "[]\n",
      "\n",
      "419 what genres are the movies written by [Antonio das Mortes] writers\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(w.name) = toLower('Antonio das Mortes Mortes]') RETURN DISTINCT g.name\n",
      "['Drama']\n",
      "[]\n",
      "\n",
      "420 who is listed as screenwriter of the movies starred by [Stormy Waters] actors\n",
      "MATCH (a:Actor)-[r1]-(m:Movie) WHERE toLower(a.name) = toLower('Stormy Waters') MATCH (m)-[r2]-(w:Writer) RETURN DISTINCT w.name\n",
      "['Willard Robertson', 'Victor Hugo', 'Michel Audiard', 'Joshua Logan', 'Jack Moffitt', 'Herbert Kretzmer', 'René Barjavel', 'Casey Robinson', 'Claude Lelouch', 'Alain Boublil', 'Henri La Barthe', 'James Norman Hall', 'Jean Renoir', 'René Clair', 'Raymond Bernard', 'Rosalind Keating Shaffer', 'William Nicholson', \"John O'Hara\", 'Jay Dratler', 'Charles Nordhoff', 'Howard Harris', 'Gladys Hurlbut', 'Émile Zola', 'William Bowers', 'Julien Duvivier', 'Jacques Prévert', 'Antoine Blondin', 'Ralph Spence']\n",
      "[]\n",
      "\n",
      "421 who starred in the films whose screenwriters also wrote [The Judge]\n",
      "MATCH (ad:Movie) WHERE toLower(ad.name) = toLower('The Judge') MATCH (ad)-[r1]-(w:Writer) MATCH (m:Movie)-[r2]-(w) MATCH (m)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Clint Howard']\n",
      "['Clint Howard', 'Vera Farmiga', 'Billy Bob Thornton', 'Robert Duvall']\n",
      "\n",
      "424 what are the languages spoken in the movies written by [Period of Adjustment] writers\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(l:Language) WHERE toLower(w.name) = toLower('Period of Adjustment Adjustment]') RETURN DISTINCT l.name\n",
      "['English', 'Italian']\n",
      "[]\n",
      "\n",
      "428 what were the release dates of films directed by the director of [Sorority Babes in the Slimeball Bowl-O-Rama]\n",
      "MATCH (d:Director)-[r]-(m:Movie) WHERE toLower(d.name) = toLower('Sorority Babes in the Slimeball Bowl-O-Rama') RETURN DISTINCT m.release_year\n",
      "['1999', '1998', '1997', '2004']\n",
      "[]\n",
      "\n",
      "431 what are the languages spoken in the movies starred by [Minnie and Moskowitz] actors\n",
      "MATCH (a:Actor)-[r1]-(m:Movie)-[r2]-(l:Language) WHERE toLower(a.name) = toLower('Minnie and Moskowitz') RETURN DISTINCT l.name\n",
      "['Hungarian', 'Italian']\n",
      "[]\n",
      "\n",
      "433 what were the release dates of films written by the screenwriter of [Prince Valiant]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(w.name) = toLower('Prince Valiant') RETURN DISTINCT m.release_year\n",
      "['2001', '2005']\n",
      "[]\n",
      "\n",
      "436 who is listed as screenwriter of the movies directed by the [Something Wicked This Way Comes] director\n",
      "MATCH (d:Director)-[r]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('Something Wicked This Way Comes Comes]') RETURN DISTINCT w.name\n",
      "['Peter Nelson', 'Cyril Hume', 'William Archibald', 'Harold Pinter', 'Owen Davis', 'Neil Paterson', 'Baz Luhrmann', 'F. Scott Fitzgerald', 'Richard Maibaum', 'Francis Ford Coppola', 'Penelope Mortimer', 'Henry James', 'John Braine', 'Brian Moore']\n",
      "[]\n",
      "\n",
      "437 which person wrote the movies starred by the actors in [Kiss of the Dragon]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Kiss of the Dragon') MATCH (m)-[r1]-(a:Actor) MATCH (a)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(w:Writer) RETURN DISTINCT w.name\n",
      "['Cameron Crowe', 'John Fusco', 'Anne Amanda Opotowsky', 'John Lutz', 'Paul Thomas Anderson', 'Sylvester Stallone', 'Rafael Yglesias', 'William Brookfield', 'Elmore Leonard', 'Robert Mundi', 'Ken Kaufman', 'Quentin Tarantino', 'James Wong', 'James Hadley Chase', 'Richard Wenk', 'David Agosto', 'Alan Parker', 'Dwight Yoakam', 'David E. Kelley', 'Kaja Blackley', 'Clare Peploe', 'Gordon Chan', 'Chris Roberts', 'Luc Besson', 'T. Coraghessan Boyle']\n",
      "['Kaja Blackley', 'Sylvester Stallone', 'Alan Parker', 'Chris Roberts', 'Elmore Leonard', 'Quentin Tarantino', 'Paul Thomas Anderson', 'Rafael Yglesias', 'James Hadley Chase', 'John Fusco', 'James Wong', 'Luc Besson', 'David E. Kelley', 'Cameron Crowe', 'Gordon Chan', 'Anne Amanda Opotowsky', 'John Lutz', 'T. Coraghessan Boyle', 'Richard Wenk', 'Ken Kaufman', 'David Agosto', 'Clare Peploe', 'William Brookfield', 'Robert Mundi', 'Dwight Yoakam', 'Jet Li']\n",
      "\n",
      "439 what types are the movies directed by the director of [Poor Little Rich Girl]\n",
      "MATCH (d:Director)-[r]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(d.name) = toLower('Poor Little Rich Girl') RETURN DISTINCT g.name\n",
      "['Drama', 'Comedy', 'Music', 'Western', 'Musical']\n",
      "[]\n",
      "\n",
      "440 when did the movies written by [Four Daughters] writers release\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Four Daughters Daughters]') MATCH (m)-[r]-(w:Writer) MATCH (w)-[r2]-(m2:Movie) RETURN DISTINCT m2.release_year\n",
      "['1934', '1949', '1983', '1932', '1972', '1961', '1966', '1941', '1946', '1931', '1944', '1947', '1954', '2000', '1964', '1952', '1938', '1959', '1958']\n",
      "[]\n",
      "\n",
      "441 what are the primary languages in the movies directed by the director of [The Hairdresser's Husband]\n",
      "MATCH (d:Director)-[r]-(m:Movie)-[r2]-(l:Language) WHERE toLower(d.name) = toLower('The Hairdresser\\'s Husband') RETURN DISTINCT l.name\n",
      "['French']\n",
      "[]\n",
      "\n",
      "442 who are the actors in the movies written by the writer of [Mystic River]\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(a:Actor) WHERE toLower(w.name) = toLower('Mystic River') RETURN DISTINCT a.name\n",
      "['Christopher Walken', 'Shannyn Sossamon', 'Kevin Spacey', 'Noomi Rapace', 'Gregg Henry', 'Russell Crowe', 'Igal Naor', 'Heath Ledger', 'Tom Hardy', 'Julia Roberts', 'Will Patton', 'Benno Fürmann', 'Olivia Williams', 'Sylvester Stallone', 'Julianne Moore', 'Dakota Fanning', 'Matthias Schoenaerts', 'Guy Pearce', 'Radha Mitchell', 'Mark Addy', 'David Paymer', 'Denzel Washington', 'Patrick Bergin', 'Chad Lowe', 'Christopher Meloni', 'Larenz Tate', 'Rufus Sewell', 'Antonio Banderas', 'Kristy Swanson', 'Harrison Ford', 'Chadwick Boseman', 'Maria Bello', 'Mel Gibson', 'Casey Affleck', 'Kevin Costner', 'Nicole Beharie', 'Paul Bettany', 'Leonardo DiCaprio', 'James Gandolfini']\n",
      "[]\n",
      "\n",
      "443 who starred in the films whose directors also directed [Step Up]\n",
      "MATCH (adhoc:Movie)-[r1]-(d:Director) WHERE toLower(adhoc.name) = toLower('Step Up') MATCH (m:Movie)-[r2]-(d) MATCH (m)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Sandra Bullock', 'Barbra Streisand', 'Craig T. Nelson', 'Mary Steenburgen', 'Seth Rogen', 'Ryan Reynolds']\n",
      "['Jenna Dewan Tatum', 'Channing Tatum', 'Barbra Streisand', 'Seth Rogen', 'Mary Steenburgen', 'Ryan Reynolds', 'Sandra Bullock', 'Craig T. Nelson']\n",
      "\n",
      "444 who are the actors in the movies directed by the director of [The Terror]\n",
      "MATCH (d:Director) WHERE toLower(d.name) = toLower('The Terror') MATCH (d)-[r1]-(m:Movie) MATCH (m)-[r2]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Brendan Gleeson', 'Jason Robards', 'Pamela Duncan', 'Shelley Winters', 'Glenn Ford', 'Boris Karloff', 'Myrna Fahey', 'Bruce Dern', 'Peter Lorre', 'Elizabeth Shepherd', 'Inger Stevens', 'Dick Miller', 'Lon Chaney Jr.', 'Val Dufour', 'Peter Fonda', 'Nancy Sinatra', 'Allison Hayes', 'John Phillip Law', 'John Cusack', 'Luke Evans', 'Jackie Joseph', 'Claudia Jennings', 'Mel Welles', 'Don Stroud', 'Sally Fraser', 'Mark Damon', 'Robert Towne', 'Vincent Price', 'Bela Lugosi', 'Richard Garland', 'Peter Graves', 'Harry Ellerbe', 'Charles Bronson', 'Debra Paget', 'Ralph Meeker', 'William Shatner', 'Susan Cabot', 'George Segal', 'Jonathan Haze', 'Lee Van Cleef', 'Beverly Garland', 'David Carradine', 'Alice Eve', 'Diane Ladd', 'Antony Carbone']\n",
      "[]\n",
      "\n",
      "452 the films directed by the director of [Bright Star] starred who\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) = toLower('Bright Star Star]') RETURN DISTINCT m.name\n",
      "['Jon Darling', 'Holly Hunter', 'Karen Colston', 'Tom Lycos', 'Meg Ryan', 'Harvey Keitel', 'Barbara Hershey', 'Nicole Kidman', 'Sam Neill', 'Anna Paquin', 'Jennifer Jason Leigh', 'John Malkovich']\n",
      "[]\n",
      "\n",
      "455 who starred films for the screenwriter of [Top Hat]\n",
      "MATCH (m:Movie)-[r1]-(w:Writer) WHERE toLower(m.name) = toLower('Top Hat') MATCH (w)-[r2]-(fm:Movie) MATCH (fm)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Alan Ladd', 'Mary Beth Hurt', 'Sydney Greenstreet', 'Katharine Hepburn', 'Jeremy Irons', 'Alexis Smith', 'Alexis Minotis', 'Fred Astaire', 'Clifton Webb', 'Michael McKean', 'Forest Whitaker', 'Sophia Loren', 'Carole Landis', 'Jason Priestley', 'Randolph Scott', 'Ginger Rogers', 'Franchot Tone', 'Victor Mature', 'Alice Brady', 'Humphrey Bogart', 'Harriet Hilliard', 'Betty Grable', 'Edward Everett Horton']\n",
      "['Randolph Scott', 'Fred Astaire', 'Harriet Hilliard', 'Ginger Rogers', 'Clifton Webb', 'Alan Ladd', 'Alexis Minotis', 'Sophia Loren', 'Sydney Greenstreet', 'Alexis Smith', 'Humphrey Bogart', 'Alice Brady', 'Edward Everett Horton', 'Victor Mature', 'Carole Landis', 'Betty Grable', 'Erik Rhodes', 'Forest Whitaker', 'Jason Priestley', 'Jeremy Irons', 'Michael McKean', 'Mary Beth Hurt', 'Katharine Hepburn', 'Franchot Tone']\n",
      "\n",
      "456 who acted in the movies written by the writer of [The Method]\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(a:Actor) WHERE toLower(w.name) = toLower('The Method') RETURN DISTINCT a.name\n",
      "['Ricardo Darín', 'Héctor Alterio', 'Leonardo Sbaraglia', 'Cecilia Dopazo', 'Cecilia Roth']\n",
      "[]\n",
      "\n",
      "457 what genres are the films starred by [Shoot to Kill] actors\n",
      "MATCH (a:Actor)-[r]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(a.name) = toLower('Shoot to Kill') RETURN DISTINCT g.name\n",
      "['Mystery', 'Romance', 'Short', 'Family', 'Horror', 'Crime', 'Drama', 'Fantasy', 'Animation', 'Music', 'Adventure', 'Action', 'Comedy', 'War', 'Thriller', 'Western']\n",
      "[]\n",
      "\n",
      "459 which person wrote the movies directed by the director of [Toni]\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('Toni') RETURN DISTINCT w.name\n",
      "['George Sessions Perry', 'René Fauchois', 'Prosper Mérimée', 'Rumer Godden', 'Jarmo Lampela', 'Robert Dillon', 'Vereen Bell', 'Burgess Meredith', 'André de Lorde', 'Jack Kirkland', 'Charles Spaak', 'Maxim Gorky', 'Giulio Macchi', 'Jean Renoir', 'Octave Mirbeau', 'Julian Barry', 'Émile Zola', 'Renzo Avanzo']\n",
      "[]\n",
      "\n",
      "460 who acted in the films written by the screenwriter of [Who Am I?]\n",
      "MATCH (w:Writer)-[r]-(m:Movie)-[r2]-(a:Actor) WHERE toLower(w.name) = toLower('Who Am I?') RETURN DISTINCT a.name\n",
      "['Leehom Wang', 'Emil Chau', 'Jackie Chan']\n",
      "[]\n",
      "\n",
      "465 which person wrote the films directed by the director of [Enemies Closer]\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('Enemies Closer') RETURN DISTINCT w.name\n",
      "['Arthur C. Clarke', 'Douglas Morrow', 'Lincoln Child', 'Gene Quintano', 'Jimmy Huston', 'Douglas Preston', 'Mark Verheiden', 'Mike Richardson', 'Karen Elise Baldwin', 'Gary DeVore', 'Paul Glickler', 'Ray Bradbury', 'Roderick Taylor', 'Wayne Kramer', 'Peter Hyams']\n",
      "[]\n",
      "\n",
      "466 what are the primary languages in the films directed by the director of [Mission to Moscow]\n",
      "MATCH (m:Movie)-[r]-(d:Director),(m)-[r2]-(l:Language) WHERE toLower(d.name) = toLower('Mission to Moscow') RETURN DISTINCT l.name\n",
      "['Italian', 'French', 'English']\n",
      "[]\n",
      "\n",
      "467 who is listed as screenwriter of the films starred by [The Towering Inferno] actors\n",
      "MATCH (a:Actor)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(a.name) = toLower('The Towering Inferno') RETURN DISTINCT w.name\n",
      "['Henrik Ibsen', 'Emir Kusturica', 'F. Hugh Herbert', 'Frank Darabont', 'Richard Russo', 'David Rayfiel', 'Ron Shelton', 'Irving Ravetch', 'John Patrick', 'Thomas Berger', 'James Poe', 'Robert Getchell', 'Roy N. Sickner', 'Jonathan Finn', 'Ethan Coen', 'Han Suyin', 'Ken Kesey', 'Thornton Wilder', 'David S. Ward', 'Jonathan Tolins', 'Robert Rossen', 'Warren Duff', 'Larry McMurtry', 'Robert Stone', 'Leonard Praskins', 'Frank Perry', 'Rod Serling', 'Henri Charrière', 'Cameron Hawley', 'Michael Keon', 'Blake Edwards', 'Clifford Odets', 'Harry Kleiner', 'Frank Pierson', 'Ring Lardner Jr.', 'Christina Crawford', 'Stephenie Meyer', 'Wanda Tuchock', 'William Faulkner', 'Bruce Graham', 'Chuck Russell', 'Walter Hill', 'Melissa Rosenberg', 'Richard Brooks', 'Albert Mannheimer', 'Lawrence Sanders', 'Julia Leigh', \"John O'Hara\", 'Frances Marion', 'Arthur Kopit', 'Melville Shavelson', 'Robert Benton', 'Terry Southern', 'Rafi Pitts', 'John Milius', 'David Beaird', 'Blaze Starr', 'Harold Pinter', 'Andrew Birkin', 'Tracy Hotchner', 'Richard Jessup', 'Frank Yablans', 'Mann Rubin', 'Garson Kanin', 'Sidney Carroll', 'Gore Vidal', 'Sam Raimi', 'Peter Milne', 'Samuel A. Taylor', 'John Lee Mahin', 'Donald Bevan', 'Charles Bukowski', 'E. Max Frye', 'Robert Anderson', 'Harry Chandlee', 'Lewis E. Lawes', 'Ernest Lehman', 'Huey Perry', 'Joe Ranft', 'Walter Tevis', 'Frank Craven', 'Daniel Taradash', 'Israel Zangwill', 'John Lasseter', 'Horton Foote', 'Jim Thompson', 'Pierre Boulle', 'Jo Heims', 'Arnold Schulman', 'Paul Brickhill', 'Leo McCarey', 'Stefan Zweig', 'Nicholas Sparks', 'Alexander Klein', 'Robert Towne', 'Tinto Brass', 'Edwin Blum', 'Paddy Chayefsky', 'Harold Flender', 'Edmund Trzcinski', 'Elmore Leonard', 'Walter Bernstein', 'John Gay', 'Richard McKenna', 'Barry Reed', 'Douglas McGrath', 'Beth Henley', 'Robert Altman', 'Robert L. Fish', 'Bonnie Hunt', 'Max Shulman', 'George Axelrod', 'Elia Kazan', 'Courtney Ryley Cooper', 'Jan de Hartog', 'Walon Green', 'Lorenzo Semple Jr.', 'Martin Rackin', 'David Mamet', 'Billy Wilder', 'Terrence Malick', 'Harold Sinclair', 'Ross Macdonald', 'John Carpenter', 'George Seaton', 'Tennessee Williams', 'Arthur Miller', 'Donn Pearce', 'Paul Osborn', 'Barbara Benedek', 'David Newman', 'Nancy Dowd', 'Daniel Nettheim', 'Julien Duvivier', 'John Hopkins', 'Irving Wallace', 'Henri Jeanson', 'William Inge', 'Richard Mason', 'Leslie Stevens', 'Sam Peckinpah', 'Brian Moore', 'Margaret Atwood', 'Richard Price', 'William Goldman', 'James Grady', 'Thomas B. Costain']\n",
      "[]\n",
      "\n",
      "470 who is listed as screenwriter of the films directed by the [Stray Dog] director\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('Stray Dog Dog]') RETURN DISTINCT w.name\n",
      "['Ingmar Bergman', 'Akira Kurosawa', 'Tsuneo Tomita']\n",
      "[]\n",
      "\n",
      "471 what types are the movies written by the writer of [A Prayer for the Dying]\n",
      "MATCH (w:Writer)-[r]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(w.name) = toLower('A Prayer for the Dying') RETURN DISTINCT g.name\n",
      "['Western']\n",
      "[]\n",
      "\n",
      "477 what are the primary languages in the movies written by the writer of [Hobson's Choice]\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(l:Language) WHERE toLower(w.name) = toLower('Hobson\\'s Choice') RETURN DISTINCT l.name\n",
      "['English']\n",
      "[]\n",
      "\n",
      "479 what types are the movies written by the screenwriter of [Shanghai Surprise]\n",
      "MATCH (w:Writer)-[r]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(w.name) = toLower('Shanghai Surprise') RETURN DISTINCT g.name\n",
      "['Horror', 'Thriller']\n",
      "[]\n",
      "\n",
      "483 what are the languages spoken in the films starred by [The Bourne Supremacy] actors\n",
      "MATCH (a:Actor)-[r]-(m:Movie)-[r2]-(l:Language) WHERE toLower(a.name) IN [n IN $The Bourne Supremacy | toLower(n)] RETURN DISTINCT l.name\n",
      "['German', 'English']\n",
      "[]\n",
      "\n",
      "484 what were the release dates of movies directed by the director of [Octopussy]\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) = toLower('Octopussy') RETURN DISTINCT m.release_year\n",
      "['1985', '2001', '1989', '1981']\n",
      "[]\n",
      "\n",
      "487 when did the movies directed by the [The Magic Flute] director release\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) = toLower('The Magic Flute Flute]') RETURN DISTINCT m.release_year AS release_year ORDER BY release_year\n",
      "['1914', '1946', '1989', '1984', '1949', '1968', '1969', '1980', '1964', '1966', '1960', '1961', '1963', '2015', '2011', '2010', '2012', '1948', '1955', '1954', '1957', '1951', '1950', '1953', '1982', '1958', '1991', '1990', '1993', '1992', '1994', '1997', '1978', '1976', '1996', '1972', '2003', '2000', '2006', '2007', '2009']\n",
      "[]\n",
      "\n",
      "488 what genres are the films directed by the [Milk] director\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(d.name) = toLower('Milk') RETURN DISTINCT g.name\n",
      "['Mystery', 'Romance', 'Horror', 'Crime', 'Drama', 'Comedy', 'Thriller']\n",
      "[]\n",
      "\n",
      "490 what are the languages spoken in the films directed by the [I Was a Male War Bride] director\n",
      "MATCH (m:Movie)-[r1]-(d:Director),(m)-[r2]-(l:Language) WHERE toLower(d.name) = toLower('I Was a Male War Bride Bride]') RETURN DISTINCT l.name\n",
      "['Swahili', 'German']\n",
      "[]\n",
      "\n",
      "496 what are the languages spoken in the films written by [Tokyo Sonata] screenwriters\n",
      "MATCH (w:Writer)-[r]-(m:Movie)-[r2]-(l:Language) WHERE toLower(w.name) CONTAINS toLower('Tokyo Sonata Sonata') RETURN DISTINCT l.name\n",
      "['Japanese', 'Flemish']\n",
      "[]\n",
      "\n",
      "497 what are the primary languages in the films written by the screenwriter of [Ashani Sanket]\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(l:Language) WHERE toLower(w.name) = toLower('Ashani Sanket') RETURN DISTINCT l.name\n",
      "['Bengali', 'English']\n",
      "[]\n",
      "\n",
      "498 what are the languages spoken in the movies directed by the [Vengo] director\n",
      "MATCH (m:Movie)-[r]-(l:Language) WHERE any(d IN m.directed_by WHERE toLower(d) = toLower('Vengo')) RETURN DISTINCT l.name\n",
      "['French']\n",
      "[]\n",
      "\n",
      "499 who acted in the movies directed by the director of [Death Wish II]\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(a:Actor) WHERE toLower(d.name) = toLower('Death Wish II') RETURN DISTINCT a.name\n",
      "['James Coburn', 'Ed Lauter', 'O.J. Simpson', 'Robert Duvall', 'Lee J. Cobb', 'John Carradine', 'Sarah Miles', 'Burt Lancaster', 'Paul Scofield', 'Michael Douglas', 'Cristina Raines', 'Orson Welles', 'Carrie Fisher', 'Jack Palance', 'Oliver Reed', 'Lauren Bacall', 'Candy Clark', 'Sophia Loren', 'John Gielgud', 'Peter Ustinov', 'Charles Bronson', 'Robert Mitchum', 'Eli Wallach', 'Eva Longoria', 'Humphrey Bogart', 'Kiefer Sutherland', 'Jason Statham', 'Chris Sarandon', 'Robert Ryan', 'Alain Delon']\n",
      "[]\n",
      "\n"
     ]
    }
   ],
   "source": [
    "for wrong in wrong_answers_no:\n",
    "    id_wrong = wrong[0]\n",
    "    print(id_wrong, df_no['question'][id_wrong])\n",
    "    print(df_no['answer_unmasked'][id_wrong])\n",
    "    print(wrong[1])\n",
    "    print(wrong[2])\n",
    "    print()\n",
    "        "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a7bd3280-f0fd-4f4d-9ba3-b508990f41f2",
   "metadata": {},
   "source": [
    "### GPT"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "0cbcd3e3-6f24-4a4d-81e0-2ac460f04419",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      " 64%|███████████████████████████████████████████████████▍                             | 319/502 [00:08<00:04, 40.59it/s]Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=1, column=106, offset=105>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 105, 'line': 1, 'column': 106}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: \"MATCH (w1:Writer)-[r1]-(m:Movie)-[r2]-(w2:Writer) WHERE toLower(w1.name) = toLower('Elizabeth Kata') AND id(w2) <> id(w1) RETURN DISTINCT w2.name\"\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=1, column=116, offset=115>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 115, 'line': 1, 'column': 116}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: \"MATCH (w1:Writer)-[r1]-(m:Movie)-[r2]-(w2:Writer) WHERE toLower(w1.name) = toLower('Elizabeth Kata') AND id(w2) <> id(w1) RETURN DISTINCT w2.name\"\n",
      " 68%|███████████████████████████████████████████████████████                          | 341/502 [00:09<00:03, 46.11it/s]Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=1, column=110, offset=109>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 109, 'line': 1, 'column': 110}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: \"MATCH (m:Movie)-[r]-(wa:Director), (m)-[r2]-(d:Director) WHERE toLower(wa.name) = toLower('Woody Allen') AND id(d) <> id(wa) RETURN DISTINCT d.name\"\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. id is deprecated. It is replaced by elementId or consider using an application-generated id.', position=<SummaryInputPosition line=1, column=119, offset=118>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 118, 'line': 1, 'column': 119}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: \"MATCH (m:Movie)-[r]-(wa:Director), (m)-[r2]-(d:Director) WHERE toLower(wa.name) = toLower('Woody Allen') AND id(d) <> id(wa) RETURN DISTINCT d.name\"\n",
      "100%|█████████████████████████████████████████████████████████████████████████████████| 502/502 [00:27<00:00, 18.01it/s]\n"
     ]
    }
   ],
   "source": [
    "parsed_results_gpt = run_cypher(list(df_gpt['answer_unmasked']), URI, AUTH)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "c8c25edf-f771-4831-b503-b11d5e0c7fcb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Accuracy: 0.8386454183266933\n",
      "#Errors: 81\n"
     ]
    }
   ],
   "source": [
    "acc_gpt, wrong_answers_gpt = accuracy_score(sample_answers[1:], parsed_results_gpt)\n",
    "print(\"Accuracy:\", acc_gpt)\n",
    "print(\"#Errors:\", len(wrong_answers_gpt))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "e3ece2cc-e132-4774-a556-0fb2d80b5fee",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "14 can you name a film directed by [Paul Wendkos]\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) = toLower('Paul Wendkos') RETURN DISTINCT m.name LIMIT 1\n",
      "['Gidget', 'Guns of the Magnificent Seven', 'Attack on the Iron Coast', 'Face of a Fugitive']\n",
      "['Guns of the Magnificent Seven']\n",
      "\n",
      "24 who acted in the movie [Singin' in the Rain]\n",
      "MATCH (m:Movie)-[r]-(a:Actor) WHERE toLower(m.name) = toLower('Singin'' in the Rain') RETURN DISTINCT a.name\n",
      "['Gene Kelly', 'Debbie Reynolds', 'Jean Hagen', \"Donald O'Connor\"]\n",
      "[]\n",
      "\n",
      "29 the film [Pennies from Heaven] starred which actors\n",
      "MATCH (m:Movie)-[r]-(a:Actor) WHERE toLower(m.name) = toLower('Pennies from Heaven') RETURN DISTINCT a.name\n",
      "['Bing Crosby', 'Louis Armstrong', 'Madge Evans', 'Edith Fellows']\n",
      "['Madge Evans', 'Bing Crosby', 'Steve Martin', 'Louis Armstrong', 'Bernadette Peters', 'Edith Fellows', 'Jessica Harper']\n",
      "\n",
      "44 what sort of film is [The Well-Digger's Daughter]\n",
      "MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(m.name) = toLower('The Well-Digger''s Daughter') RETURN DISTINCT g.name\n",
      "['Drama', 'Comedy']\n",
      "[]\n",
      "\n",
      "50 what was the genre of [You'll Never Get Rich]\n",
      "MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(m.name) = toLower('You''ll Never Get Rich') RETURN DISTINCT g.name\n",
      "['Comedy', 'Musical']\n",
      "[]\n",
      "\n",
      "63 what was the genre of the film [Bad Boys]\n",
      "MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(m.name) = toLower('Bad Boys') RETURN DISTINCT g.name\n",
      "['Drama', 'Crime']\n",
      "['Drama', 'Comedy', 'Crime', 'Action']\n",
      "\n",
      "73 which topics is movie [Burden of Dreams] about\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Burden of Dreams') UNWIND coalesce(m.has_tags, []) AS topic RETURN DISTINCT topic UNION MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(m.name) = toLower('Burden of Dreams') RETURN DISTINCT g.name AS topic\n",
      "['bd-r', 'south america', 'werner herzog', 'jungle', '3']\n",
      "['bd-r', 'south america', 'werner herzog', 'jungle', '3', 'Documentary']\n",
      "\n",
      "75 what topics is [Free Willy] about\n",
      "MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(m.name) = toLower('Free Willy') RETURN DISTINCT g.name\n",
      "['family']\n",
      "['Drama', 'Family']\n",
      "\n",
      "76 what are some words that describe movie [Linsanity]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Linsanity') UNWIND coalesce(m.has_tags, []) AS word RETURN DISTINCT word UNION MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(m.name) = toLower('Linsanity') RETURN DISTINCT g.name AS word\n",
      "['basketball']\n",
      "['basketball', 'Documentary']\n",
      "\n",
      "79 can you give a few words describing what [Jeff, Who Lives at Home] is about\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Jeff, Who Lives at Home') WITH m, coalesce(m.has_tags, []) AS tags, coalesce(m.has_genre, []) AS genresProp OPTIONAL MATCH (m:Movie)-[r]-(g:Genre) WITH tags + genresProp + collect(DISTINCT g.name) AS words UNWIND words AS word RETURN DISTINCT word\n",
      "['jason segel', 'judy greer', 'mark duplass']\n",
      "[]\n",
      "\n",
      "80 describe [The Butcher Boy]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('The Butcher Boy') OPTIONAL MATCH (m)-[r1]-(d:Director) OPTIONAL MATCH (m)-[r2]-(w:Writer) OPTIONAL MATCH (m)-[r3]-(a:Actor) OPTIONAL MATCH (m)-[r4]-(g:Genre) OPTIONAL MATCH (m)-[r5]-(l:Language) RETURN DISTINCT m.name AS title, m.release_year AS release_year, m.has_imdb_rating AS imdb_rating, m.has_imdb_votes AS imdb_votes, m.has_tags AS tags, collect(DISTINCT d.name) AS directors, collect(DISTINCT w.name) AS writers, collect(DISTINCT a.name) AS actors, collect(DISTINCT g.name) AS genres, collect(DISTINCT l.name) AS languages\n",
      "['neil jordan']\n",
      "['The Butcher Boy', ['1997'], None, None, ['neil jordan'], ['Neil Jordan'], ['Neil Jordan'], ['Eamonn Owens'], ['Drama'], []]\n",
      "\n",
      "81 which topics is [Death Wish] about\n",
      "MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(m.name) = toLower('Death Wish') RETURN DISTINCT g.name\n",
      "['vigilante', 'charles bronson', 'michael winner']\n",
      "['Drama', 'Crime', 'Action']\n",
      "\n",
      "82 can you describe movie [The Final Destination] in a few words\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('The Final Destination') OPTIONAL MATCH (m)-[r1]-(g:Genre) WITH m, collect(DISTINCT g.name) AS genres OPTIONAL MATCH (m)-[r2]-(d:Director) WITH m, genres, collect(DISTINCT d.name) AS directors RETURN DISTINCT coalesce(reduce(s = '', x IN genres | s + (case when s = '' then '' else ', ' end) + x), 'Movie') + case when size(directors) > 0 then ' by ' + reduce(s = '', x IN directors | s + (case when s = '' then '' else ', ' end) + x) else '' end + case when size(coalesce(m.release_year, [])) > 0 then ' (' + toString(head(m.release_year)) + ')' else '' end AS description\n",
      "['franchise']\n",
      "['Horror by David R. Ellis (2009)']\n",
      "\n",
      "84 can you give a few words describing [The Iron Horse]\n",
      "MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(m.name) = toLower('The Iron Horse') RETURN DISTINCT g.name\n",
      "['john ford', 'silent']\n",
      "[]\n",
      "\n",
      "85 describe [Riot in Cell Block 11] in a few words\n",
      "MATCH (m:Movie)-[r]-(g:Genre) WHERE toLower(m.name) = toLower('Riot in Cell Block 11') RETURN DISTINCT g.name\n",
      "['don siegel']\n",
      "['Drama']\n",
      "\n",
      "86 describe the movie [The Good Heart] in a few words\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('The Good Heart') MATCH (m)-[r]-(g:Genre) RETURN DISTINCT g.name\n",
      "['paul dano']\n",
      "[]\n",
      "\n",
      "88 who was the writer of the film [Molière]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Molière') RETURN DISTINCT w.name\n",
      "['Ariane Mnouchkine']\n",
      "['Ariane Mnouchkine', 'Grégoire Vigneron', 'Laurent Tirard']\n",
      "\n",
      "90 who wrote the film [A Soldier's Story]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('A Soldier''s Story') RETURN DISTINCT w.name\n",
      "['Charles Fuller']\n",
      "[]\n",
      "\n",
      "93 which person wrote the movie [Ned Kelly]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Ned Kelly') RETURN DISTINCT w.name\n",
      "['Tony Richardson']\n",
      "['John Michael McDonagh', 'Tony Richardson', 'Robert Drewe']\n",
      "\n",
      "101 who in the world wrote [Journey to the Center of the Earth]\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Journey to the Center of the Earth') RETURN DISTINCT w.name\n",
      "['Rusty Lemorande']\n",
      "['Jules Verne', 'Rusty Lemorande', 'Charles Brackett']\n",
      "\n",
      "106 what was the release date of [The Man Who Laughs]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('The Man Who Laughs') RETURN DISTINCT m.release_year\n",
      "['2012']\n",
      "[['2012', '1928']]\n",
      "\n",
      "110 when was the movie [Stardust] released\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Stardust') RETURN DISTINCT m.release_year\n",
      "['2007']\n",
      "[['2007', '1974']]\n",
      "\n",
      "116 what year was [Doppelganger] released\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Doppelganger') RETURN DISTINCT m.release_year\n",
      "['2003']\n",
      "[['1993', '2003']]\n",
      "\n",
      "120 which films are about [shahrukh khan]\n",
      "MATCH (m:Movie)-[r]-(a:Actor) WHERE toLower(a.name) = toLower('shahrukh khan') RETURN DISTINCT m.name\n",
      "['My Name Is Khan', 'Dilwale Dulhania Le Jayenge', 'Chennai Express', 'Om Shanti Om', 'Mohabbatein', 'Duplicate']\n",
      "[]\n",
      "\n",
      "122 what movies can be described by [elisha cuthbert]\n",
      "MATCH (m:Movie)-[r]-(a:Actor) WHERE toLower(a.name) = toLower('elisha cuthbert') RETURN DISTINCT m.name\n",
      "['The Girl Next Door', 'He Was a Quiet Man', 'The Quiet']\n",
      "['Captivity', 'My Sassy Girl', 'House of Wax', 'The Quiet', 'The Girl Next Door']\n",
      "\n",
      "124 what films are about [anthony mackie]\n",
      "MATCH (m:Movie)-[r]-(a:Actor) WHERE toLower(a.name) = toLower('anthony mackie') RETURN DISTINCT m.name\n",
      "['The Hurt Locker']\n",
      "['Repentance', 'Crossover', 'Night Catches Us', 'The Hurt Locker', 'She Hate Me', 'Runner Runner']\n",
      "\n",
      "126 which movies are about [david frankel]\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) = toLower('david frankel') RETURN DISTINCT m.name UNION MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(w.name) = toLower('david frankel') RETURN DISTINCT m.name UNION MATCH (m:Movie)-[r]-(a:Actor) WHERE toLower(a.name) = toLower('david frankel') RETURN DISTINCT m.name\n",
      "['The Devil Wears Prada', 'Hope Springs']\n",
      "['One Chance', 'The Big Year', 'The Devil Wears Prada', 'Miami Rhapsody', 'Hope Springs', 'Funny About Love']\n",
      "\n",
      "191 which person wrote the movies directed by [Niki Caro]\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('Niki Caro') RETURN DISTINCT w.name\n",
      "['Michael Seitzman', 'Clara Bingham', 'Witi Ihimaera', 'Laura Leedy']\n",
      "['Niki Caro', 'Witi Ihimaera', 'Clara Bingham', 'Michael Seitzman', 'Laura Leedy']\n",
      "\n",
      "198 what are the movies that have the same actor of [Cookie's Fortune]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Cookie''s Fortune') MATCH (m)-[r]-(a:Actor) MATCH (other:Movie)-[r2]-(a) WHERE other <> m RETURN DISTINCT other.name\n",
      "['Hoodwinked Too! Hood vs. Evil', 'Nine Months', 'The Three Musketeers', 'The Bachelor', 'The Stepford Wives', 'Heights', 'The Big Chill', 'What Maisie Knew', 'Savage Grace', 'Chloe', 'Trust the Man', '101 Dalmatians', 'The English Teacher', 'Game Change', 'The Big Lebowski', 'Hannibal', 'Being Flynn', 'Onegin', 'The Strangers', 'The Ledge', 'Air Force One', 'Reversal of Fortune', 'Tarzan', 'Laws of Attraction', \"Men Don't Leave\", 'Cast a Deadly Spell', 'The Forgotten', 'Still Alice', 'Super', 'The Safety of Objects', 'Mad Love', 'Assassins', 'Sarah, Plain and Tall', 'The Incredible Hulk', 'Paradise Road', 'Mars Attacks!', 'The World According to Garp', 'Freedomland', 'Fatal Attraction', 'Skylark', 'Maps to the Stars', 'Evolution', 'In Love and War', 'Seventh Son', 'Don Jon', 'Hoodwinked!', 'Next', 'Immediate Family', 'The Paper', 'Heavy', 'The Hours', 'Reign Over Me', \"The Gun in Betty Lou's Handbag\", 'Carrie', 'The Natural', 'Albert Nobbs', '102 Dalmatians', 'Anne Frank Remembered', 'Armageddon', 'The Prize Winner of Defiance, Ohio', 'Far from Heaven', 'Non-Stop', 'Hamlet', 'Vertical Limit', 'School Ties', 'Marie and Bruce', 'Scent of a Woman', 'Roommates', 'The End of the Affair', 'The Shipping News', 'The Chamber', 'Kinsey', 'Dangerous Liaisons']\n",
      "[]\n",
      "\n",
      "205 who are the writers of the movies directed by [Jack Plotnick]\n",
      "MATCH (d:Director) WHERE toLower(d.name) = toLower('Jack Plotnick') MATCH (m:Movie)-[r1]-(d) MATCH (m)-[r2]-(w:Writer) RETURN DISTINCT w.name\n",
      "['Sam Pancake', 'Michael Stoyanov', 'Kali Rocha']\n",
      "['Kali Rocha', 'Sam Pancake', 'Jack Plotnick', 'Michael Stoyanov']\n",
      "\n",
      "222 what were the release dates of [Kirk Jones] directed films\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) = toLower('Kirk Jones') RETURN DISTINCT m.name, m.release_year\n",
      "['1990', '2009', '2012', '2005']\n",
      "[\"What to Expect When You're Expecting\", ['2012'], \"Everybody's Fine\", ['1990', '2009'], 'Nanny McPhee', ['2005']]\n",
      "\n",
      "226 the movies written by [Mark Miller] starred who\n",
      "MATCH (w:Writer)-[r]-(m:Movie)-[r2]-(a:Actor) WHERE toLower(w.name) = toLower('Mark Miller') RETURN DISTINCT a.name\n",
      "['Donovan Scott', 'Keanu Reeves', 'Anthony Quinn', 'Bridgette Andersen', 'Giancarlo Giannini']\n",
      "['Anthony Quinn', 'Giancarlo Giannini', 'Keanu Reeves', 'Bridgette Andersen', 'Mark Miller', 'Donovan Scott']\n",
      "\n",
      "230 when did the movies acted by [Ignat Daniltsev] release\n",
      "MATCH (a:Actor)-[r]-(m:Movie) WHERE toLower(a.name) = toLower('Ignat Daniltsev') RETURN DISTINCT m.name, m.release_year\n",
      "['1975', '1997']\n",
      "['The Mirror', ['1997', '1975']]\n",
      "\n",
      "258 who wrote the screenplay for the movies starred by [Chris Stapp]\n",
      "MATCH (a:Actor)-[r]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(a.name) = toLower('Chris Stapp') RETURN DISTINCT w.name\n",
      "['Matt Heath']\n",
      "['Chris Stapp', 'Matt Heath']\n",
      "\n",
      "263 the actor in [The Adventure of Sherlock Holmes' Smarter Brother] also appears in which movies\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('The Adventure of Sherlock Holmes'' Smarter Brother') MATCH (m)-[r]-(a:Actor) MATCH (a)-[r2]-(other:Movie) WHERE other.name <> m.name RETURN DISTINCT other.name\n",
      "['Mixed Nuts', 'Silver Streak', 'The End', 'The Twelve Chairs', 'The Frisco Kid', 'The Scarecrow', 'Haunted Honeymoon', 'The Last Remake of Beau Geste', 'High Anxiety', 'The Secret of NIMH', 'Young Frankenstein', 'Clue', \"Betsy's Wedding\", 'Start the Revolution Without Me', 'Stir Crazy', 'First Family', 'Funny About Love', 'Quackser Fortune Has a Cousin in the Bronx', \"What's Up, Doc?\", 'Blazing Saddles', 'The Best Little Whorehouse in Texas', 'Smokey and the Bandit II', 'The Cannonball Run', 'See No Evil, Hear No Evil', 'The Producers', \"The World's Greatest Lover\", 'Happily Ever After', 'A Troll in Central Park', 'Hanky Panky', 'Sextette', 'Another You', 'The Woman in Red', 'Fatso', 'The Godson', 'All Dogs Go to Heaven']\n",
      "[]\n",
      "\n",
      "277 who is listed as screenwriter of [Susanna Fogel] directed films\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('Susanna Fogel') RETURN DISTINCT w.name\n",
      "['Joni Lefkowitz']\n",
      "['Susanna Fogel', 'Joni Lefkowitz']\n",
      "\n",
      "281 when did the films directed by [Ringo Lam] release\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(d.name) = toLower('Ringo Lam') RETURN DISTINCT m.name, m.release_year\n",
      "['1987', '1992', '1996', '2003', '2001', '2007', '2009']\n",
      "['City on Fire', ['1987'], 'Replicant', ['2001'], 'In Hell', ['2003'], 'Maximum Risk', ['1996'], 'Triangle', ['2009', '2007'], 'Twin Dragons', ['1992']]\n",
      "\n",
      "317 who are the writers of the films directed by [James Dearden]\n",
      "MATCH (m:Movie)-[r1]-(d:Director), (m)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('James Dearden') RETURN DISTINCT w.name\n",
      "['Lawrence Roman', 'Barry Unsworth', 'Nick Leeson', 'Ira Levin']\n",
      "['Lawrence Roman', 'James Dearden', 'Ira Levin', 'Nick Leeson', 'Barry Unsworth']\n",
      "\n",
      "320 the movies written by [Costa Botes] were directed by who\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(d:Director) WHERE toLower(w.name) = toLower('Costa Botes') RETURN DISTINCT d.name\n",
      "['Peter Jackson']\n",
      "['Peter Jackson', 'Costa Botes']\n",
      "\n",
      "337 the films directed by [Jules Stewart] were written by who\n",
      "MATCH (m:Movie)-[r1]-(d:Director) WHERE toLower(d.name) = toLower('Jules Stewart') MATCH (m)-[r2]-(w:Writer) RETURN DISTINCT w.name\n",
      "['Jared Kurt']\n",
      "['Jared Kurt', 'Jules Stewart']\n",
      "\n",
      "344 who is listed as screenwriter of [Raoul Ruiz] directed movies\n",
      "MATCH (d:Director)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(d.name) = toLower('Raoul Ruiz') RETURN DISTINCT w.name\n",
      "['Gilbert Adair', 'Duane Poole']\n",
      "['Raoul Ruiz', 'Gilbert Adair', 'Duane Poole']\n",
      "\n",
      "353 who starred movies for the director of [Written on the Wind]\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(m.name) = toLower('Written on the Wind') MATCH (d)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Sandra Dee', 'Charles Coburn', 'Cornel Wilde', 'John Gavin', 'Warren William', 'Susan Kohner', 'Joan Bennett', 'Fred MacMurray', 'Barbara Stanwyck', 'Don Ameche', 'Jane Wyman', 'Rochelle Hudson', 'Boris Karloff', 'Patricia Knight', 'Robert Cummings', 'Rock Hudson', 'Lucille Ball', 'Claudette Colbert', 'Lana Turner', 'George Sanders']\n",
      "['Barbara Stanwyck', 'Fred MacMurray', 'Joan Bennett', 'Robert Stack', 'Dorothy Malone', 'Rock Hudson', 'Lauren Bacall', 'Jane Wyman', 'Warren William', 'Sandra Dee', 'Rochelle Hudson', 'Lana Turner', 'Claudette Colbert', 'Susan Kohner', 'John Gavin', 'Patricia Knight', 'Cornel Wilde', 'Charles Coburn', 'Boris Karloff', 'George Sanders', 'Lucille Ball', 'Don Ameche', 'Robert Cummings']\n",
      "\n",
      "359 who are the directors of the movies written by the writer of [She]\n",
      "MATCH (mShe:Movie)-[r1]-(w:Writer) WHERE toLower(mShe.name) = toLower('She') MATCH (w)-[r2]-(m:Movie) MATCH (m)-[r3]-(d:Director) RETURN DISTINCT d.name\n",
      "['Gary Nelson']\n",
      "['Gary Nelson', 'Robert Day']\n",
      "\n",
      "364 when did the films written by [Send Me No Flowers] writers release\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Send Me No Flowers') MATCH (m)-[r]-(w:Writer) MATCH (f:Movie)-[r2]-(w) RETURN DISTINCT f.release_year\n",
      "['1983', '1932', '1966', '1941', '1972', '1944', '1961', '1954', '1938', '1958']\n",
      "[['1958'], ['1944'], ['1938'], ['1961', '1932'], ['1941'], ['1954'], ['1964'], ['1966'], ['1972'], ['1983']]\n",
      "\n",
      "365 who are the writers that the actors in their films also appear in the film [The Creature Wasn't Nice]\n",
      "MATCH (w:Writer)-[r1]-(m:Movie)-[r2]-(a:Actor)-[r3]-(m2:Movie) WHERE toLower(m2.name) = toLower('The Creature Wasn''t Nice') RETURN DISTINCT w.name\n",
      "['Stephen King', 'Krzysztof Zanussi', 'Bruce Kimmel', 'Craig Mazin', 'Robert Zemeckis', 'Joseph Dougherty', 'Don Mancini', 'Aaron Seltzer', 'Pat Proft', 'Bob Gale', 'Bob Logan', 'Cyril Hume', 'Jason Friedberg', 'Mary Chase', 'Cid Ricketts Sumner']\n",
      "[]\n",
      "\n",
      "366 what genres are the movies starred by [Trog] actors\n",
      "MATCH (a:Actor)-[r]-(m:Movie)-[r2]-(g:Genre) WHERE toLower(a.name) = toLower('Trog') RETURN DISTINCT g.name\n",
      "['Horror', 'Drama', 'Fantasy', 'Music', 'Western', 'Comedy', 'Musical', 'Thriller']\n",
      "[]\n",
      "\n",
      "370 who starred films for the director of [Flickering Lights]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Flickering Lights') MATCH (m)-[r1]-(d:Director) MATCH (d)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Mads Mikkelsen', 'Ulrich Thomsen', 'Line Kruse', 'Nikolaj Lie Kaas']\n",
      "['Mads Mikkelsen', 'Ulrich Thomsen', 'Nikolaj Lie Kaas', 'Line Kruse', 'Søren Pilmark']\n",
      "\n",
      "373 which person wrote the films acted by the actors in [The Slingshot]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('The Slingshot') MATCH (m)-[r1]-(a:Actor) MATCH (a)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(w:Writer) RETURN DISTINCT w.name\n",
      "['Matt Damon', 'Ben Affleck', 'J.D. Zeik', 'Dashiell Hammett', 'Eric Lomax', 'Ronald Harwood', 'David Mamet', 'Hans Petter Moland', 'Aimee Lagos', 'Catherine Johnson', 'Steve Barancik', 'Hans Alfredson', 'Wesley Strick', 'Zafar Hai', 'Kjell Grede']\n",
      "['Wesley Strick', 'David Mamet', 'Catherine Johnson', 'Dashiell Hammett', 'Ronald Harwood', 'Eric Lomax', 'Ben Affleck', 'Zafar Hai', 'Steve Barancik', 'Aimee Lagos', 'Hans Alfredson', 'Kjell Grede', 'Matt Damon', 'J.D. Zeik', 'Hans Petter Moland', 'Åke Sandgren', 'Roland Schütt']\n",
      "\n",
      "374 who are the directors that the actors in their films also appear in the film [The Birdcage]\n",
      "MATCH (tb:Movie) WHERE toLower(tb.name) = toLower('The Birdcage') MATCH (d:Director)-[r]-(m:Movie) WITH tb, d, m MATCH (a:Actor)-[r]-(m) WITH tb, d, a MATCH (a:Actor)-[r]-(tb:Movie) RETURN DISTINCT d.name\n",
      "['Tim Burton', 'Peter Kassovitz', 'Frederick De Cordova', 'Joseph L. Mankiewicz', 'Lawrence Kasdan', 'Woody Allen', 'Peter Hyams', 'Ronald Neame', 'Roger Spottiswoode', 'Barry Levinson', 'Fielder Cook', 'Shinji Aoyama', 'Paul Mazursky', 'Don Bluth', 'John Moore', 'Peter Masterson', 'Sydney Pollack', 'Bobcat Goldthwait', 'Arthur Penn', 'Kelly Reichardt', 'Les Mayfield', 'Danny DeVito', 'Bob Clark', 'Wes Anderson', 'Gilbert Cates', 'Chris Columbus', 'Peter Weir', 'Richard Brooks', 'Catherine Hardwicke', 'Robert Benton', 'Roger Christian', 'Gus Van Sant', 'Basil Dearden', 'John Cameron Mitchell', 'Susan Stroman', 'George Roy Hill', 'Donald Petrie', 'Bill Forsyth', 'Mark Mylod', 'George Schaefer', 'Ron Clements', 'Garry Marshall', 'Robert Altman', 'Tom Shadyac', 'Don Medford', 'Sam Raimi', 'Mel Brooks', 'Ron Howard', 'Arie Posin', 'Ted Kotcheff', 'Robert Day', 'John Frankenheimer', 'Nicolas Roeg', 'Joe Johnston', 'Michael Ritchie', 'William Friedkin', 'Penny Marshall', 'David Duchovny', 'Peter Markle', 'Walt Becker', 'Stephen Hopkins', 'Simon Moore', 'Michael Apted', 'David Anspaugh', 'Griffin Dunne', 'Jessie Nelson', 'Harold Ramis', 'Ken Kwapis', 'Penny Panayotopoulou', 'James Foley', 'Andrew Bergman', 'Dick Richards', 'Bud Yorkin', 'Omar Naim', 'Steven Spielberg', 'Vincent Ward', 'Tony Scott', 'Richard Donner', 'Irwin Allen', 'Francis Ford Coppola', 'Tarsem Singh', 'Dirk Shafer', 'Barry Sonnenfeld', 'Jesse V. Johnson', 'Richard Lester', 'Gary Fleder', 'Stanley Donen', 'Andrew Davis', 'Alan Parker', 'Clint Eastwood', 'Gary Goldman', 'Ivan Reitman', 'Howard Deutch', 'Phil Alden Robinson', 'David Mamet', 'Nicholas Meyer', 'Mark Romanek', 'Roger Donaldson', 'John Musker']\n",
      "['Clint Eastwood', 'Michael Ritchie', 'John Musker', 'Ron Clements', 'Nicholas Meyer', 'Francis Ford Coppola', 'Steven Spielberg', 'Mike Nichols', 'David Mamet', 'Roger Christian', 'Peter Hyams', 'Tim Burton', 'Garry Marshall', 'Michael Apted', 'Richard Lester', 'John Frankenheimer', 'Robert Benton', 'Catherine Hardwicke', 'Barry Levinson', 'Joseph L. Mankiewicz', 'Alan Parker', 'Andrew Davis', 'George Roy Hill', 'Joe Johnston', 'Basil Dearden', 'Wes Anderson', 'Roger Donaldson', 'Chris Columbus', 'Robert Altman', 'Bobcat Goldthwait', 'Peter Kassovitz', 'Bob Clark', 'Penny Marshall', 'Peter Weir', 'Peter Masterson', 'Roger Spottiswoode', 'Sam Raimi', 'Mel Brooks', 'Woody Allen', 'James Foley', 'Sydney Pollack', 'Ted Kotcheff', 'Ronald Neame', 'Tom Shadyac', 'Penny Panayotopoulou', 'Tony Scott', 'Gary Fleder', 'Harold Ramis', 'Don Bluth', 'Griffin Dunne', 'Ron Howard', 'Richard Brooks', 'Gary Goldman', 'David Duchovny', 'Gus Van Sant', 'Richard Donner', 'Stanley Donen', 'William Friedkin', 'Kelly Reichardt', 'Susan Stroman', 'Frederick De Cordova', 'Arthur Penn', 'Phil Alden Robinson', 'Howard Deutch', 'Barry Sonnenfeld', 'Paul Mazursky', 'Stephen Hopkins', 'Gilbert Cates', 'Dick Richards', 'Don Medford', 'Peter Markle', 'Nicolas Roeg', 'Andrew Bergman', 'Danny DeVito', 'Les Mayfield', 'Jesse V. Johnson', 'Bud Yorkin', 'Dirk Shafer', 'Donald Petrie', 'David Anspaugh', 'Ken Kwapis', 'Ivan Reitman', 'Tarsem Singh', 'Lawrence Kasdan', 'Walt Becker', 'Shinji Aoyama', 'Simon Moore', 'Jessie Nelson', 'Robert Day', 'John Cameron Mitchell', 'John Moore', 'Irwin Allen', 'Fielder Cook', 'George Schaefer', 'Mark Mylod', 'Bill Forsyth', 'Mark Romanek', 'Vincent Ward', 'Omar Naim', 'Arie Posin']\n",
      "\n",
      "378 who are the directors of films whose writers also wrote [People Like Us]\n",
      "MATCH (plu:Movie) WHERE toLower(plu.name) = toLower('People Like Us') MATCH (plu)-[r1]-(w:Writer) MATCH (w)-[r2]-(m:Movie) MATCH (m)-[r3]-(d:Director) RETURN DISTINCT d.name\n",
      "['Marc Webb', 'Michael Bay']\n",
      "['Michael Bay', 'Marc Webb', 'Alex Kurtzman']\n",
      "\n",
      "380 the films written by the writer of [Lions for Lambs] starred who\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Lions for Lambs') WITH DISTINCT w MATCH (m2:Movie)-[r2]-(w) MATCH (m2)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Rachel McAdams', 'Ben Affleck', 'Brad Pitt', 'Russell Crowe', 'Jennifer Garner', 'Jamie Foxx', 'Chris Cooper', 'Jason Bateman', 'Helen Mirren']\n",
      "['Brad Pitt', 'Meryl Streep', 'Tom Cruise', 'Robert Redford', 'Jamie Foxx', 'Jennifer Garner', 'Chris Cooper', 'Jason Bateman', 'Helen Mirren', 'Russell Crowe', 'Rachel McAdams', 'Ben Affleck']\n",
      "\n",
      "381 what are the genres of the films whose screenwriters also wrote [Summer Hours]\n",
      "MATCH (sh:Movie)-[r1]-(w:Writer) WHERE toLower(sh.name) = toLower('Summer Hours') MATCH (m:Movie)-[r2]-(w) MATCH (m)-[r3]-(g:Genre) RETURN DISTINCT g.name\n",
      "['Drama', 'Thriller']\n",
      "['Drama', 'Thriller', 'Family']\n",
      "\n",
      "383 who are the actors in the films directed by the director of [The Mirror Has Two Faces]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('The Mirror Has Two Faces') MATCH (m)-[r1]-(d:Director) MATCH (m2:Movie)-[r2]-(d) MATCH (m2)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Barbra Streisand', 'Nick Nolte']\n",
      "['Lauren Bacall', 'George Segal', 'Jeff Bridges', 'Barbra Streisand', 'Nick Nolte']\n",
      "\n",
      "386 which person directed the films acted by the actors in [Kid Millions]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Kid Millions') MATCH (m)-[r1]-(a:Actor) MATCH (a)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(d:Director) RETURN DISTINCT d.name\n",
      "['David Butler']\n",
      "['Roy Del Ruth', 'David Butler']\n",
      "\n",
      "389 what types are the films directed by the director of [Min and Bill]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Min and Bill') MATCH (m)-[r1]-(d:Director) MATCH (d)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(g:Genre) RETURN DISTINCT g.name\n",
      "['Crime']\n",
      "['Drama', 'Comedy', 'Crime']\n",
      "\n",
      "396 what genres are the films written by [Mac and Me] screenwriters\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Mac and Me') MATCH (m)-[r]-(w:Writer) MATCH (w)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(g:Genre) RETURN DISTINCT g.name\n",
      "['Drama', 'Adventure']\n",
      "['Drama', 'Adventure', 'Family']\n",
      "\n",
      "398 which person directed the movies starred by the actors in [Common]\n",
      "WITH [x IN ['Common'] | toLower(x)] AS actorNames MATCH (a:Actor)-[r1]-(m:Movie)-[r2]-(d:Director) WHERE toLower(a.name) IN actorNames RETURN DISTINCT d.name\n",
      "['Robert Altman', 'Tim Burton', 'David Hare', 'John Irvin', 'Karel Reisz', 'Kevin Costner', 'Rupert Wyatt', 'John Frankenheimer', 'Scott Michell', 'Barry Levinson', 'Károly Makk']\n",
      "[]\n",
      "\n",
      "400 who starred in the movies whose director also directed [What Ever Happened to Baby Jane?]\n",
      "MATCH (target:Movie) WHERE toLower(target.name) = toLower('What Ever Happened to Baby Jane?') MATCH (target)-[r1]-(d:Director) MATCH (d)-[r2]-(m:Movie) MATCH (m)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Cesar Romero', 'Jeff Chandler', 'Richard Jaeckel', 'Joan Crawford', 'Ian Bannen', 'Frank Sinatra', 'Ida Lupino', 'Gary Cooper', 'Burt Lancaster', 'Dean Martin', 'Ben Johnson', 'Jim Brown', 'Bruce Davison', 'Catherine Deneuve', 'Harry Andrews', 'Kirk Douglas', 'Dorothy Malone', 'Burt Reynolds', 'Michael Caine', 'Peter Falk', 'Kim Novak', 'Hardy Krüger', 'Anita Ekberg', 'Ernest Borgnine', 'Gene Wilder', 'Joseph Cotten', 'Lee Marvin', 'Cliff Robertson', 'Eddie Albert', 'Martine Carol', 'Rock Hudson', 'Jean Hagen', 'Charles Bronson', 'Robert Strauss', 'Paul Winfield', 'Peter Finch', 'Ralph Meeker', 'Vicki Frederick', 'Harrison Ford', 'Ursula Andress', 'Wendell Corey', 'Denise Darcel', 'James Stewart', 'Jack Palance', 'Laurene Landon', 'Richard Attenborough']\n",
      "['Denise Darcel', 'Cesar Romero', 'Burt Lancaster', 'Gary Cooper', 'Gene Wilder', 'Harrison Ford', 'Anita Ekberg', 'Frank Sinatra', 'Ursula Andress', 'Dean Martin', 'Cliff Robertson', 'Joan Crawford', 'Richard Attenborough', 'Peter Finch', 'Hardy Krüger', 'James Stewart', 'Kirk Douglas', 'Rock Hudson', 'Joseph Cotten', 'Dorothy Malone', 'Michael Caine', 'Harry Andrews', 'Ian Bannen', 'Vicki Frederick', 'Peter Falk', 'Laurene Landon', 'Bette Davis', 'Ralph Meeker', 'Ida Lupino', 'Jack Palance', 'Jean Hagen', 'Wendell Corey', 'Ernest Borgnine', 'Kim Novak', 'Richard Jaeckel', 'Bruce Davison', 'Robert Strauss', 'Lee Marvin', 'Eddie Albert', 'Charles Bronson', 'Jim Brown', 'Jeff Chandler', 'Martine Carol', 'Catherine Deneuve', 'Ben Johnson', 'Burt Reynolds', 'Paul Winfield']\n",
      "\n",
      "403 when did the films directed by the [Return of the Fly] director release\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(m.name) = toLower('Return of the Fly') MATCH (d)-[r2]-(m2:Movie) RETURN DISTINCT m2.release_year\n",
      "['1956', '1958']\n",
      "[['1959'], None, ['1956'], ['1958']]\n",
      "\n",
      "406 the movies written by the screenwriter of [Frenchman's Creek] were directed by who\n",
      "MATCH (m:Movie)-[r]-(w:Writer) WHERE toLower(m.name) = toLower('Frenchman''s Creek') MATCH (w)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(d:Director) RETURN DISTINCT d.name\n",
      "['Charles Sturridge', 'Nicolas Roeg', 'Alfred Hitchcock', 'Henry Koster', 'Brian Desmond Hurst']\n",
      "[]\n",
      "\n",
      "412 what were the release years of the films that share directors with the film [Safe]\n",
      "MATCH (m:Movie)-[r]-(d:Director)-[r2]-(m2:Movie) WHERE toLower(m.name) = toLower('[Safe]') AND m2 <> m RETURN DISTINCT m2.release_year\n",
      "['1991', '1994', '1998', '2002', '2003', '2000', '2008']\n",
      "[]\n",
      "\n",
      "414 what are the genres of the films whose directors also directed [In the Name of the Law]\n",
      "MATCH (m1:Movie) WHERE toLower(m1.name) = toLower('In the Name of the Law') MATCH (m1)-[r1]-(d:Director) MATCH (m2:Movie)-[r2]-(d) MATCH (m2)-[r3]-(g:Genre) RETURN DISTINCT g.name\n",
      "['Comedy', 'Documentary']\n",
      "['Drama', 'Comedy', 'Documentary']\n",
      "\n",
      "416 who is listed as director of the movies starred by [Solo] actors\n",
      "MATCH (a:Actor)-[r]-(m:Movie) WHERE toLower(a.name) = toLower('Solo') MATCH (m)-[r2]-(d:Director) RETURN DISTINCT d.name\n",
      "['Jonathan Kesselman', 'Stuart Gillard', 'Daniel Petrie', 'Walter Hill', 'Joel Schumacher', 'Kirk Douglas', 'Gavin Wilding', 'Dave Parker', 'Anthony Hickox', 'Mario Van Peebles', 'Bruce Malmuth']\n",
      "[]\n",
      "\n",
      "417 the movies written by the screenwriter of [Sinbad and the Eye of the Tiger] starred who\n",
      "MATCH (m1:Movie)-[r1]-(w:Writer) WHERE toLower(m1.name) = toLower('Sinbad and the Eye of the Tiger') MATCH (m2:Movie)-[r2]-(w) MATCH (m2)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['John Phillip Law']\n",
      "['John Phillip Law', 'Taryn Power', 'Margaret Whiting', 'Patrick Wayne', 'Jane Seymour']\n",
      "\n",
      "418 who are the directors of the films written by the writer of [Two for the Road]\n",
      "MATCH (m:Movie)-[r1]-(w:Writer) WHERE toLower(m.name) = toLower('Two for the Road') MATCH (w)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(d:Director) RETURN DISTINCT d.name\n",
      "['John Schlesinger', 'Peter Bogdanovich', 'Stanley Kubrick', 'Johan Kling']\n",
      "['John Schlesinger', 'Peter Bogdanovich', 'Stanley Kubrick', 'Stanley Donen', 'Johan Kling']\n",
      "\n",
      "420 who is listed as screenwriter of the movies starred by [Stormy Waters] actors\n",
      "MATCH (a:Actor)-[r1]-(m:Movie)-[r2]-(w:Writer) WHERE toLower(a.name) = toLower('Stormy Waters') RETURN DISTINCT w.name\n",
      "['Willard Robertson', 'Victor Hugo', 'Michel Audiard', 'Joshua Logan', 'Jack Moffitt', 'Herbert Kretzmer', 'René Barjavel', 'Casey Robinson', 'Claude Lelouch', 'Alain Boublil', 'Henri La Barthe', 'James Norman Hall', 'Jean Renoir', 'René Clair', 'Raymond Bernard', 'Rosalind Keating Shaffer', 'William Nicholson', \"John O'Hara\", 'Jay Dratler', 'Charles Nordhoff', 'Howard Harris', 'Gladys Hurlbut', 'Émile Zola', 'William Bowers', 'Julien Duvivier', 'Jacques Prévert', 'Antoine Blondin', 'Ralph Spence']\n",
      "[]\n",
      "\n",
      "433 what were the release dates of films written by the screenwriter of [Prince Valiant]\n",
      "MATCH (pv:Movie)-[r]-(w:Writer) WHERE toLower(pv.name) = toLower('Prince Valiant') MATCH (w)-[r2]-(m:Movie) RETURN DISTINCT m.release_year AS release_year ORDER BY release_year\n",
      "['2001', '2005']\n",
      "[['1997'], ['2001'], ['2005']]\n",
      "\n",
      "436 who is listed as screenwriter of the movies directed by the [Something Wicked This Way Comes] director\n",
      "MATCH (m1:Movie)-[r1]-(d:Director) WHERE toLower(m1.name) = toLower('Something Wicked This Way Comes') MATCH (d)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(w:Writer) RETURN DISTINCT w.name\n",
      "['Peter Nelson', 'Cyril Hume', 'William Archibald', 'Harold Pinter', 'Owen Davis', 'Neil Paterson', 'Baz Luhrmann', 'F. Scott Fitzgerald', 'Richard Maibaum', 'Francis Ford Coppola', 'Penelope Mortimer', 'Henry James', 'John Braine', 'Brian Moore']\n",
      "['John Braine', 'Neil Paterson', 'Ray Bradbury', 'William Archibald', 'Henry James', 'Owen Davis', 'Francis Ford Coppola', 'Cyril Hume', 'F. Scott Fitzgerald', 'Richard Maibaum', 'Baz Luhrmann', 'Penelope Mortimer', 'Harold Pinter', 'Brian Moore', 'Peter Nelson']\n",
      "\n",
      "437 which person wrote the movies starred by the actors in [Kiss of the Dragon]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Kiss of the Dragon') MATCH (m)-[r1]-(a:Actor) MATCH (a)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(w:Writer) RETURN DISTINCT w.name\n",
      "['Cameron Crowe', 'John Fusco', 'Anne Amanda Opotowsky', 'John Lutz', 'Paul Thomas Anderson', 'Sylvester Stallone', 'Rafael Yglesias', 'William Brookfield', 'Elmore Leonard', 'Robert Mundi', 'Ken Kaufman', 'Quentin Tarantino', 'James Wong', 'James Hadley Chase', 'Richard Wenk', 'David Agosto', 'Alan Parker', 'Dwight Yoakam', 'David E. Kelley', 'Kaja Blackley', 'Clare Peploe', 'Gordon Chan', 'Chris Roberts', 'Luc Besson', 'T. Coraghessan Boyle']\n",
      "['Kaja Blackley', 'Sylvester Stallone', 'Alan Parker', 'Chris Roberts', 'Elmore Leonard', 'Quentin Tarantino', 'Paul Thomas Anderson', 'Rafael Yglesias', 'James Hadley Chase', 'John Fusco', 'James Wong', 'Luc Besson', 'David E. Kelley', 'Cameron Crowe', 'Gordon Chan', 'Anne Amanda Opotowsky', 'John Lutz', 'T. Coraghessan Boyle', 'Richard Wenk', 'Ken Kaufman', 'David Agosto', 'Clare Peploe', 'William Brookfield', 'Robert Mundi', 'Dwight Yoakam', 'Jet Li']\n",
      "\n",
      "440 when did the movies written by [Four Daughters] writers release\n",
      "MATCH (m1:Movie)-[r1]-(w:Writer) WHERE toLower(m1.name) = toLower('Four Daughters') WITH DISTINCT w MATCH (m2:Movie)-[r2]-(w) RETURN DISTINCT m2.name, m2.release_year\n",
      "['1934', '1949', '1983', '1932', '1972', '1961', '1966', '1941', '1946', '1931', '1944', '1947', '1954', '2000', '1964', '1952', '1938', '1959', '1958']\n",
      "['Four Daughters', ['1938'], 'Five and Ten', ['1931'], 'Imitation of Life', ['1934', '1959'], 'Back Street', ['1941', '1961'], 'Humoresque', ['1946'], 'The Great Lie', ['1941'], 'White Banners', ['1938'], 'Sudden Fear', ['1952'], 'Beyond the Forest', ['1949'], 'Possessed', ['1931', '1947', '2000'], 'The Brothers Karamazov', ['1958'], 'Arsenic and Old Lace', ['1944'], 'Fanny', ['1961', '1932'], 'The Bride Came C.O.D.', ['1941'], 'The Last Time I Saw Paris', ['1954'], 'Send Me No Flowers', ['1964'], 'Any Wednesday', ['1966'], \"Pete 'n' Tillie\", ['1972'], 'The Reluctant Debutante', ['1958'], 'Reuben, Reuben', ['1983']]\n",
      "\n",
      "441 what are the primary languages in the movies directed by the director of [The Hairdresser's Husband]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('The Hairdresser''s Husband') MATCH (m)-[r]-(d:Director) MATCH (d)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(l:Language) RETURN DISTINCT l.name\n",
      "['French']\n",
      "[]\n",
      "\n",
      "452 the films directed by the director of [Bright Star] starred who\n",
      "MATCH (b:Movie) WHERE toLower(b.name) = toLower('Bright Star') MATCH (b)-[r1]-(d:Director) MATCH (m:Movie)-[r2]-(d) MATCH (m)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Jon Darling', 'Holly Hunter', 'Karen Colston', 'Tom Lycos', 'Meg Ryan', 'Harvey Keitel', 'Barbara Hershey', 'Nicole Kidman', 'Sam Neill', 'Anna Paquin', 'Jennifer Jason Leigh', 'John Malkovich']\n",
      "['Ben Whishaw', 'Abbie Cornish', 'John Malkovich', 'Nicole Kidman', 'Barbara Hershey', 'Jennifer Jason Leigh', 'Meg Ryan', 'Karen Colston', 'Tom Lycos', 'Jon Darling', 'Anna Paquin', 'Holly Hunter', 'Sam Neill', 'Harvey Keitel']\n",
      "\n",
      "455 who starred films for the screenwriter of [Top Hat]\n",
      "MATCH (m:Movie)-[r1]-(w:Writer) WHERE toLower(m.name) = toLower('Top Hat') MATCH (w)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Alan Ladd', 'Mary Beth Hurt', 'Sydney Greenstreet', 'Katharine Hepburn', 'Jeremy Irons', 'Alexis Smith', 'Alexis Minotis', 'Fred Astaire', 'Clifton Webb', 'Michael McKean', 'Forest Whitaker', 'Sophia Loren', 'Carole Landis', 'Jason Priestley', 'Randolph Scott', 'Ginger Rogers', 'Franchot Tone', 'Victor Mature', 'Alice Brady', 'Humphrey Bogart', 'Harriet Hilliard', 'Betty Grable', 'Edward Everett Horton']\n",
      "['Randolph Scott', 'Fred Astaire', 'Harriet Hilliard', 'Ginger Rogers', 'Clifton Webb', 'Alan Ladd', 'Alexis Minotis', 'Sophia Loren', 'Sydney Greenstreet', 'Alexis Smith', 'Humphrey Bogart', 'Alice Brady', 'Edward Everett Horton', 'Victor Mature', 'Carole Landis', 'Betty Grable', 'Erik Rhodes', 'Forest Whitaker', 'Jason Priestley', 'Jeremy Irons', 'Michael McKean', 'Mary Beth Hurt', 'Katharine Hepburn', 'Franchot Tone']\n",
      "\n",
      "456 who acted in the movies written by the writer of [The Method]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('The Method') MATCH (m)-[r1]-(w:Writer) MATCH (w)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(a:Actor) RETURN DISTINCT a.name\n",
      "['Ricardo Darín', 'Héctor Alterio', 'Leonardo Sbaraglia', 'Cecilia Dopazo', 'Cecilia Roth']\n",
      "['Najwa Nimri', 'Pablo Echarri', 'Eduard Fernández', 'Eduardo Noriega', 'Cecilia Roth', 'Ricardo Darín', 'Héctor Alterio', 'Leonardo Sbaraglia', 'Cecilia Dopazo']\n",
      "\n",
      "477 what are the primary languages in the movies written by the writer of [Hobson's Choice]\n",
      "MATCH (m:Movie)-[r1]-(w:Writer)-[r2]-(m2:Movie)-[r3]-(l:Language) WHERE toLower(m.name) = toLower('Hobson''s Choice') RETURN DISTINCT l.name\n",
      "['English']\n",
      "[]\n",
      "\n",
      "479 what types are the movies written by the screenwriter of [Shanghai Surprise]\n",
      "MATCH (m:Movie) WHERE toLower(m.name) = toLower('Shanghai Surprise') MATCH (m)-[r]-(w:Writer) MATCH (w)-[r2]-(m2:Movie) MATCH (m2)-[r3]-(g:Genre) RETURN DISTINCT g.name\n",
      "['Horror', 'Thriller']\n",
      "['Thriller', 'Horror', 'Adventure']\n",
      "\n",
      "484 what were the release dates of movies directed by the director of [Octopussy]\n",
      "MATCH (m:Movie)-[r1]-(d:Director) WHERE toLower(m.name) = toLower('Octopussy') MATCH (d)-[r2]-(m2:Movie) RETURN DISTINCT m2.release_year\n",
      "['1985', '2001', '1989', '1981']\n",
      "[['1985'], ['1989'], ['1983'], ['1981'], ['2001']]\n",
      "\n",
      "487 when did the movies directed by the [The Magic Flute] director release\n",
      "MATCH (m:Movie)-[r]-(d:Director) WHERE toLower(m.name) = toLower('The Magic Flute') MATCH (o:Movie)-[r2]-(d:Director) RETURN DISTINCT o.release_year\n",
      "['1914', '1946', '1989', '1984', '1949', '1968', '1969', '1980', '1964', '1966', '1960', '1961', '1963', '2015', '2011', '2010', '2012', '1948', '1955', '1954', '1957', '1951', '1950', '1953', '1982', '1958', '1991', '1990', '1993', '1992', '1994', '1997', '1978', '1976', '1996', '1972', '2003', '2000', '2006', '2007', '2009']\n",
      "[['1961'], ['1955'], ['1949'], ['1969'], ['1964'], ['1958'], ['1968'], ['1960'], ['1957'], ['1990', '1955'], ['1984'], ['1980'], ['1975', '2006'], ['1951'], ['1966'], ['1978'], ['1950'], ['2003'], ['2010', '1949'], ['1982'], ['2010', '1963'], ['1946', '1950'], ['1954'], None, ['1948'], ['1976'], ['1968', '2011'], ['1953'], ['1992'], ['2007', '1972'], ['2000'], ['2011'], ['1989'], ['1991'], ['1950', '2015', '1997', '1914'], ['2012', '1993'], ['2006'], ['1994'], ['1948', '1996', '1964', '2009', '2000', '1969', '1990']]\n",
      "\n",
      "488 what genres are the films directed by the [Milk] director\n",
      "MATCH (milk:Movie)-[r1]-(d:Director) WHERE toLower(milk.name) = toLower('Milk') MATCH (m:Movie)-[r2]-(d) MATCH (m)-[r3]-(g:Genre) RETURN DISTINCT g.name\n",
      "['Mystery', 'Romance', 'Horror', 'Crime', 'Drama', 'Comedy', 'Thriller']\n",
      "['Drama', 'Comedy', 'Thriller', 'Crime', 'Horror', 'Romance', 'Biography', 'Mystery']\n",
      "\n",
      "490 what are the languages spoken in the films directed by the [I Was a Male War Bride] director\n",
      "MATCH (m1:Movie)-[r1]-(d:Director) WHERE toLower(m1.name) = toLower('I Was a Male War Bride') MATCH (d)-[r2]-(m2:Movie)-[r3]-(l:Language) RETURN DISTINCT l.name\n",
      "['Swahili', 'German']\n",
      "['French', 'German', 'Swahili']\n",
      "\n",
      "491 who are the directors of movies whose writers also wrote [Outrageous Fortune]\n",
      "MATCH (m_out:Movie) WHERE toLower(m_out.name) = toLower('Outrageous Fortune') MATCH (m_out)-[r1]-(w:Writer) MATCH (m:Movie)-[r2]-(w) MATCH (m)-[r3]-(d:Director) RETURN DISTINCT d.name\n",
      "['Elaine May', 'Mimi Leder', 'Peter Farrelly', 'John Waters', 'Adam Shankman']\n",
      "['Arthur Hiller', 'John Waters', 'Mimi Leder', 'Peter Farrelly', 'Adam Shankman', 'Elaine May']\n",
      "\n"
     ]
    }
   ],
   "source": [
    "for wrong in wrong_answers_gpt:\n",
    "    id_wrong = wrong[0]\n",
    "    print(id_wrong, df_gpt['question'][id_wrong])\n",
    "    print(df_gpt['answer_unmasked'][id_wrong])\n",
    "    print(wrong[1])\n",
    "    print(wrong[2])\n",
    "    print()\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "3fb7d0fa-da39-4221-a869-6f71f745869c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "True accuracy:  0.9402390438247012\n"
     ]
    }
   ],
   "source": [
    "print(\"True accuracy: \", ((502 - len(wrong_answers_gpt) + 51) / 502))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f8ac1017-c00c-43f2-9236-6cb1a32f4e28",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
